[Survived] EqualityOperator
src/engine/PlayerDevelopment.js:99:30
         PHYSICAL_ATTRS.forEach(attr => {
             if (player.attributes[attr] !== undefined && rng.chance(physDeclineChance)) {
                 const oldVal = player.attributes[attr];
-                const drop = yearsOverDecline >= 3 ? 2 : 1;
+                const drop = yearsOverDecline < 3 ? 2 : 1;
                 player.attributes[attr] = Math.max(20, oldVal - drop);
                 if (player.attributes[attr] < oldVal) {

[Killed] MethodExpression
src/engine/PlayerDevelopment.js:100:43
             if (player.attributes[attr] !== undefined && rng.chance(physDeclineChance)) {
                 const oldVal = player.attributes[attr];
                 const drop = yearsOverDecline >= 3 ? 2 : 1;
-                player.attributes[attr] = Math.max(20, oldVal - drop);
+                player.attributes[attr] = Math.min(20, oldVal - drop);
                 if (player.attributes[attr] < oldVal) {
                     changes.push({ type: 'decline', player: player.name, attr, from: oldVal, to: player.attributes[attr] });
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Survived] ArithmeticOperator
src/engine/PlayerDevelopment.js:100:56
             if (player.attributes[attr] !== undefined && rng.chance(physDeclineChance)) {
                 const oldVal = player.attributes[attr];
                 const drop = yearsOverDecline >= 3 ? 2 : 1;
-                player.attributes[attr] = Math.max(20, oldVal - drop);
+                player.attributes[attr] = Math.max(20, oldVal + drop);
                 if (player.attributes[attr] < oldVal) {
                     changes.push({ type: 'decline', player: player.name, attr, from: oldVal, to: player.attributes[attr] });

[Survived] BlockStatement
src/engine/PlayerDevelopment.js:101:55
                 const oldVal = player.attributes[attr];
                 const drop = yearsOverDecline >= 3 ? 2 : 1;
                 player.attributes[attr] = Math.max(20, oldVal - drop);
-                if (player.attributes[attr] < oldVal) {
-                    changes.push({ type: 'decline', player: player.name, attr, from: oldVal, to: player.attributes[attr] });
-                }
+                if (player.attributes[attr] < oldVal) {}
             }
         });

[Survived] ConditionalExpression
src/engine/PlayerDevelopment.js:101:21
                 const oldVal = player.attributes[attr];
                 const drop = yearsOverDecline >= 3 ? 2 : 1;
                 player.attributes[attr] = Math.max(20, oldVal - drop);
-                if (player.attributes[attr] < oldVal) {
+                if (false) {
                     changes.push({ type: 'decline', player: player.name, attr, from: oldVal, to: player.attributes[attr] });
                 }

[Survived] ObjectLiteral
src/engine/PlayerDevelopment.js:102:34
                 const drop = yearsOverDecline >= 3 ? 2 : 1;
                 player.attributes[attr] = Math.max(20, oldVal - drop);
                 if (player.attributes[attr] < oldVal) {
-                    changes.push({ type: 'decline', player: player.name, attr, from: oldVal, to: player.attributes[attr] });
+                    changes.push({});
                 }
             }

[Killed] ArithmeticOperator
src/engine/PlayerDevelopment.js:108:35
         });
 
         // Technical attributes: decline slowly (§3.1)
-        const techDeclineChance = yearsOverDecline * 0.03; // 3% per year
+        const techDeclineChance = yearsOverDecline / 0.03; // 3% per year
         TECHNICAL_ATTRS.forEach(attr => {
             if (player.attributes[attr] !== undefined && rng.chance(techDeclineChance)) {
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] BlockStatement
src/engine/PlayerDevelopment.js:109:41
 
         // Technical attributes: decline slowly (§3.1)
         const techDeclineChance = yearsOverDecline * 0.03; // 3% per year
-        TECHNICAL_ATTRS.forEach(attr => {
-            if (player.attributes[attr] !== undefined && rng.chance(techDeclineChance)) {
-                const oldVal = player.attributes[attr];
-                player.attributes[attr] = Math.max(25, oldVal - 1);
-                if (player.attributes[attr] < oldVal) {
-                    changes.push({ type: 'decline', player: player.name, attr, from: oldVal, to: player.attributes[attr] });
-                }
-            }
-        });
+        TECHNICAL_ATTRS.forEach(attr => {});
 
         // DEF attribute: position-dependent decline
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] BlockStatement
src/engine/PlayerDevelopment.js:110:89
         // Technical attributes: decline slowly (§3.1)
         const techDeclineChance = yearsOverDecline * 0.03; // 3% per year
         TECHNICAL_ATTRS.forEach(attr => {
-            if (player.attributes[attr] !== undefined && rng.chance(techDeclineChance)) {
-                const oldVal = player.attributes[attr];
-                player.attributes[attr] = Math.max(25, oldVal - 1);
-                if (player.attributes[attr] < oldVal) {
-                    changes.push({ type: 'decline', player: player.name, attr, from: oldVal, to: player.attributes[attr] });
-                }
-            }
+            if (player.attributes[attr] !== undefined && rng.chance(techDeclineChance)) {}
         });
 
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] EqualityOperator
src/engine/PlayerDevelopment.js:110:17
         // Technical attributes: decline slowly (§3.1)
         const techDeclineChance = yearsOverDecline * 0.03; // 3% per year
         TECHNICAL_ATTRS.forEach(attr => {
-            if (player.attributes[attr] !== undefined && rng.chance(techDeclineChance)) {
+            if (player.attributes[attr] === undefined && rng.chance(techDeclineChance)) {
                 const oldVal = player.attributes[attr];
                 player.attributes[attr] = Math.max(25, oldVal - 1);
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] MethodExpression
src/engine/PlayerDevelopment.js:112:43
         TECHNICAL_ATTRS.forEach(attr => {
             if (player.attributes[attr] !== undefined && rng.chance(techDeclineChance)) {
                 const oldVal = player.attributes[attr];
-                player.attributes[attr] = Math.max(25, oldVal - 1);
+                player.attributes[attr] = Math.min(25, oldVal - 1);
                 if (player.attributes[attr] < oldVal) {
                     changes.push({ type: 'decline', player: player.name, attr, from: oldVal, to: player.attributes[attr] });
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] ArithmeticOperator
src/engine/PlayerDevelopment.js:112:56
         TECHNICAL_ATTRS.forEach(attr => {
             if (player.attributes[attr] !== undefined && rng.chance(techDeclineChance)) {
                 const oldVal = player.attributes[attr];
-                player.attributes[attr] = Math.max(25, oldVal - 1);
+                player.attributes[attr] = Math.max(25, oldVal + 1);
                 if (player.attributes[attr] < oldVal) {
                     changes.push({ type: 'decline', player: player.name, attr, from: oldVal, to: player.attributes[attr] });
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Survived] EqualityOperator
src/engine/PlayerDevelopment.js:113:21
             if (player.attributes[attr] !== undefined && rng.chance(techDeclineChance)) {
                 const oldVal = player.attributes[attr];
                 player.attributes[attr] = Math.max(25, oldVal - 1);
-                if (player.attributes[attr] < oldVal) {
+                if (player.attributes[attr] <= oldVal) {
                     changes.push({ type: 'decline', player: player.name, attr, from: oldVal, to: player.attributes[attr] });
                 }

[Survived] EqualityOperator
src/engine/PlayerDevelopment.js:113:21
             if (player.attributes[attr] !== undefined && rng.chance(techDeclineChance)) {
                 const oldVal = player.attributes[attr];
                 player.attributes[attr] = Math.max(25, oldVal - 1);
-                if (player.attributes[attr] < oldVal) {
+                if (player.attributes[attr] >= oldVal) {
                     changes.push({ type: 'decline', player: player.name, attr, from: oldVal, to: player.attributes[attr] });
                 }

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:114:42
                 const oldVal = player.attributes[attr];
                 player.attributes[attr] = Math.max(25, oldVal - 1);
                 if (player.attributes[attr] < oldVal) {
-                    changes.push({ type: 'decline', player: player.name, attr, from: oldVal, to: player.attributes[attr] });
+                    changes.push({ type: "", player: player.name, attr, from: oldVal, to: player.attributes[attr] });
                 }
             }

[Killed] ConditionalExpression
src/engine/PlayerDevelopment.js:121:13
 
         // DEF attribute: position-dependent decline
         // Centerbacks/GKs lose defensive awareness slower (cognitive compensates)
-        if (player.attributes[DEFENSIVE_ATTR] !== undefined) {
+        if (false) {
             const defDeclineRate = (player.position === 'DEF' || player.position === 'GOL')
                 ? yearsOverDecline * 0.02  // very slow — experience compensates
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] EqualityOperator
src/engine/PlayerDevelopment.js:121:13
 
         // DEF attribute: position-dependent decline
         // Centerbacks/GKs lose defensive awareness slower (cognitive compensates)
-        if (player.attributes[DEFENSIVE_ATTR] !== undefined) {
+        if (player.attributes[DEFENSIVE_ATTR] === undefined) {
             const defDeclineRate = (player.position === 'DEF' || player.position === 'GOL')
                 ? yearsOverDecline * 0.02  // very slow — experience compensates
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] EqualityOperator
src/engine/PlayerDevelopment.js:122:37
         // DEF attribute: position-dependent decline
         // Centerbacks/GKs lose defensive awareness slower (cognitive compensates)
         if (player.attributes[DEFENSIVE_ATTR] !== undefined) {
-            const defDeclineRate = (player.position === 'DEF' || player.position === 'GOL')
+            const defDeclineRate = (player.position !== 'DEF' || player.position === 'GOL')
                 ? yearsOverDecline * 0.02  // very slow — experience compensates
                 : yearsOverDecline * 0.04; // moderate for other positions
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] ConditionalExpression
src/engine/PlayerDevelopment.js:122:37
         // DEF attribute: position-dependent decline
         // Centerbacks/GKs lose defensive awareness slower (cognitive compensates)
         if (player.attributes[DEFENSIVE_ATTR] !== undefined) {
-            const defDeclineRate = (player.position === 'DEF' || player.position === 'GOL')
+            const defDeclineRate = (false)
                 ? yearsOverDecline * 0.02  // very slow — experience compensates
                 : yearsOverDecline * 0.04; // moderate for other positions
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] ArithmeticOperator
src/engine/PlayerDevelopment.js:123:19
         // Centerbacks/GKs lose defensive awareness slower (cognitive compensates)
         if (player.attributes[DEFENSIVE_ATTR] !== undefined) {
             const defDeclineRate = (player.position === 'DEF' || player.position === 'GOL')
-                ? yearsOverDecline * 0.02  // very slow — experience compensates
+                ? yearsOverDecline / 0.02 // very slow — experience compensates  // very slow — experience compensates
                 : yearsOverDecline * 0.04; // moderate for other positions
             if (rng.chance(defDeclineRate)) {
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Survived] ArithmeticOperator
src/engine/PlayerDevelopment.js:124:19
         if (player.attributes[DEFENSIVE_ATTR] !== undefined) {
             const defDeclineRate = (player.position === 'DEF' || player.position === 'GOL')
                 ? yearsOverDecline * 0.02  // very slow — experience compensates
-                : yearsOverDecline * 0.04; // moderate for other positions
+                : yearsOverDecline / 0.04; // moderate for other positions
             if (rng.chance(defDeclineRate)) {
                 const oldVal = player.attributes[DEFENSIVE_ATTR];

[Killed] BlockStatement
src/engine/PlayerDevelopment.js:125:45
             const defDeclineRate = (player.position === 'DEF' || player.position === 'GOL')
                 ? yearsOverDecline * 0.02  // very slow — experience compensates
                 : yearsOverDecline * 0.04; // moderate for other positions
-            if (rng.chance(defDeclineRate)) {
-                const oldVal = player.attributes[DEFENSIVE_ATTR];
-                player.attributes[DEFENSIVE_ATTR] = Math.max(25, oldVal - 1);
-                if (player.attributes[DEFENSIVE_ATTR] < oldVal) {
-                    changes.push({ type: 'decline', player: player.name, attr: DEFENSIVE_ATTR, from: oldVal, to: player.attributes[DEFENSIVE_ATTR] });
-                }
-            }
+            if (rng.chance(defDeclineRate)) {}
         }
 
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] ConditionalExpression
src/engine/PlayerDevelopment.js:125:17
             const defDeclineRate = (player.position === 'DEF' || player.position === 'GOL')
                 ? yearsOverDecline * 0.02  // very slow — experience compensates
                 : yearsOverDecline * 0.04; // moderate for other positions
-            if (rng.chance(defDeclineRate)) {
+            if (false) {
                 const oldVal = player.attributes[DEFENSIVE_ATTR];
                 player.attributes[DEFENSIVE_ATTR] = Math.max(25, oldVal - 1);
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] MethodExpression
src/engine/PlayerDevelopment.js:127:53
                 : yearsOverDecline * 0.04; // moderate for other positions
             if (rng.chance(defDeclineRate)) {
                 const oldVal = player.attributes[DEFENSIVE_ATTR];
-                player.attributes[DEFENSIVE_ATTR] = Math.max(25, oldVal - 1);
+                player.attributes[DEFENSIVE_ATTR] = Math.min(25, oldVal - 1);
                 if (player.attributes[DEFENSIVE_ATTR] < oldVal) {
                     changes.push({ type: 'decline', player: player.name, attr: DEFENSIVE_ATTR, from: oldVal, to: player.attributes[DEFENSIVE_ATTR] });
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] ArithmeticOperator
src/engine/PlayerDevelopment.js:127:66
                 : yearsOverDecline * 0.04; // moderate for other positions
             if (rng.chance(defDeclineRate)) {
                 const oldVal = player.attributes[DEFENSIVE_ATTR];
-                player.attributes[DEFENSIVE_ATTR] = Math.max(25, oldVal - 1);
+                player.attributes[DEFENSIVE_ATTR] = Math.max(25, oldVal + 1);
                 if (player.attributes[DEFENSIVE_ATTR] < oldVal) {
                     changes.push({ type: 'decline', player: player.name, attr: DEFENSIVE_ATTR, from: oldVal, to: player.attributes[DEFENSIVE_ATTR] });
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Survived] ConditionalExpression
src/engine/PlayerDevelopment.js:128:21
             if (rng.chance(defDeclineRate)) {
                 const oldVal = player.attributes[DEFENSIVE_ATTR];
                 player.attributes[DEFENSIVE_ATTR] = Math.max(25, oldVal - 1);
-                if (player.attributes[DEFENSIVE_ATTR] < oldVal) {
+                if (true) {
                     changes.push({ type: 'decline', player: player.name, attr: DEFENSIVE_ATTR, from: oldVal, to: player.attributes[DEFENSIVE_ATTR] });
                 }

[Survived] BlockStatement
src/engine/PlayerDevelopment.js:128:65
             if (rng.chance(defDeclineRate)) {
                 const oldVal = player.attributes[DEFENSIVE_ATTR];
                 player.attributes[DEFENSIVE_ATTR] = Math.max(25, oldVal - 1);
-                if (player.attributes[DEFENSIVE_ATTR] < oldVal) {
-                    changes.push({ type: 'decline', player: player.name, attr: DEFENSIVE_ATTR, from: oldVal, to: player.attributes[DEFENSIVE_ATTR] });
-                }
+                if (player.attributes[DEFENSIVE_ATTR] < oldVal) {}
             }
         }

[Survived] ArithmeticOperator
src/engine/PlayerDevelopment.js:136:36
 
         // Mental attributes: can IMPROVE past peak! (§3.1)
         // Creativity/positioning grows from experience — 5% chance per year
-        const mentalGrowthChance = 0.05 * personalityMod;
+        const mentalGrowthChance = 0.05 / personalityMod;
         MENTAL_ATTRS.forEach(attr => {
             if (player.attributes[attr] !== undefined && rng.chance(mentalGrowthChance)) {

[Killed] BlockStatement
src/engine/PlayerDevelopment.js:137:38
         // Mental attributes: can IMPROVE past peak! (§3.1)
         // Creativity/positioning grows from experience — 5% chance per year
         const mentalGrowthChance = 0.05 * personalityMod;
-        MENTAL_ATTRS.forEach(attr => {
-            if (player.attributes[attr] !== undefined && rng.chance(mentalGrowthChance)) {
-                const oldVal = player.attributes[attr];
-                player.attributes[attr] = Math.min(99, oldVal + 1);
-                if (player.attributes[attr] > oldVal) {
-                    changes.push({ type: 'growth', player: player.name, attr, from: oldVal, to: player.attributes[attr] });
-                }
-            }
-        });
+        MENTAL_ATTRS.forEach(attr => {});
     }
 
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] ConditionalExpression
src/engine/PlayerDevelopment.js:138:17
         // Creativity/positioning grows from experience — 5% chance per year
         const mentalGrowthChance = 0.05 * personalityMod;
         MENTAL_ATTRS.forEach(attr => {
-            if (player.attributes[attr] !== undefined && rng.chance(mentalGrowthChance)) {
+            if (true) {
                 const oldVal = player.attributes[attr];
                 player.attributes[attr] = Math.min(99, oldVal + 1);
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] BlockStatement
src/engine/PlayerDevelopment.js:138:90
         // Creativity/positioning grows from experience — 5% chance per year
         const mentalGrowthChance = 0.05 * personalityMod;
         MENTAL_ATTRS.forEach(attr => {
-            if (player.attributes[attr] !== undefined && rng.chance(mentalGrowthChance)) {
-                const oldVal = player.attributes[attr];
-                player.attributes[attr] = Math.min(99, oldVal + 1);
-                if (player.attributes[attr] > oldVal) {
-                    changes.push({ type: 'growth', player: player.name, attr, from: oldVal, to: player.attributes[attr] });
-                }
-            }
+            if (player.attributes[attr] !== undefined && rng.chance(mentalGrowthChance)) {}
         });
     }
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] ArithmeticOperator
src/engine/PlayerDevelopment.js:140:56
         MENTAL_ATTRS.forEach(attr => {
             if (player.attributes[attr] !== undefined && rng.chance(mentalGrowthChance)) {
                 const oldVal = player.attributes[attr];
-                player.attributes[attr] = Math.min(99, oldVal + 1);
+                player.attributes[attr] = Math.min(99, oldVal - 1);
                 if (player.attributes[attr] > oldVal) {
                     changes.push({ type: 'growth', player: player.name, attr, from: oldVal, to: player.attributes[attr] });
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Survived] MethodExpression
src/engine/PlayerDevelopment.js:140:43
         MENTAL_ATTRS.forEach(attr => {
             if (player.attributes[attr] !== undefined && rng.chance(mentalGrowthChance)) {
                 const oldVal = player.attributes[attr];
-                player.attributes[attr] = Math.min(99, oldVal + 1);
+                player.attributes[attr] = Math.max(99, oldVal + 1);
                 if (player.attributes[attr] > oldVal) {
                     changes.push({ type: 'growth', player: player.name, attr, from: oldVal, to: player.attributes[attr] });

[Survived] EqualityOperator
src/engine/PlayerDevelopment.js:141:21
             if (player.attributes[attr] !== undefined && rng.chance(mentalGrowthChance)) {
                 const oldVal = player.attributes[attr];
                 player.attributes[attr] = Math.min(99, oldVal + 1);
-                if (player.attributes[attr] > oldVal) {
+                if (player.attributes[attr] >= oldVal) {
                     changes.push({ type: 'growth', player: player.name, attr, from: oldVal, to: player.attributes[attr] });
                 }

[Survived] EqualityOperator
src/engine/PlayerDevelopment.js:141:21
             if (player.attributes[attr] !== undefined && rng.chance(mentalGrowthChance)) {
                 const oldVal = player.attributes[attr];
                 player.attributes[attr] = Math.min(99, oldVal + 1);
-                if (player.attributes[attr] > oldVal) {
+                if (player.attributes[attr] <= oldVal) {
                     changes.push({ type: 'growth', player: player.name, attr, from: oldVal, to: player.attributes[attr] });
                 }

[Killed] BlockStatement
src/engine/PlayerDevelopment.js:149:40
     }
 
     // === APOSENTADORIA (position-aware) ===
-    if (player.age >= curve.retireMin) {
-        const yearsOverRetireMin = player.age - curve.retireMin;
-        const retireChance = (yearsOverRetireMin + 1) * 0.12;
-        if (rng.chance(retireChance)) {
-            player._retired = true;
-            changes.push({ type: 'retirement', player: player.name, age: player.age });
-        }
-    }
+    if (player.age >= curve.retireMin) {}
     // BUG-079: safety cap — force-retire if age > 42 (probability of reaching this
     // naturally is ~0, so any player here escaped the stochastic retirement system).
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] ConditionalExpression
src/engine/PlayerDevelopment.js:149:9
     }
 
     // === APOSENTADORIA (position-aware) ===
-    if (player.age >= curve.retireMin) {
+    if (true) {
         const yearsOverRetireMin = player.age - curve.retireMin;
         const retireChance = (yearsOverRetireMin + 1) * 0.12;
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] ArithmeticOperator
src/engine/PlayerDevelopment.js:150:36
 
     // === APOSENTADORIA (position-aware) ===
     if (player.age >= curve.retireMin) {
-        const yearsOverRetireMin = player.age - curve.retireMin;
+        const yearsOverRetireMin = player.age + curve.retireMin;
         const retireChance = (yearsOverRetireMin + 1) * 0.12;
         if (rng.chance(retireChance)) {
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] ArithmeticOperator
src/engine/PlayerDevelopment.js:151:31
     // === APOSENTADORIA (position-aware) ===
     if (player.age >= curve.retireMin) {
         const yearsOverRetireMin = player.age - curve.retireMin;
-        const retireChance = (yearsOverRetireMin + 1) * 0.12;
+        const retireChance = (yearsOverRetireMin - 1) * 0.12;
         if (rng.chance(retireChance)) {
             player._retired = true;
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] ArithmeticOperator
src/engine/PlayerDevelopment.js:151:30
     // === APOSENTADORIA (position-aware) ===
     if (player.age >= curve.retireMin) {
         const yearsOverRetireMin = player.age - curve.retireMin;
-        const retireChance = (yearsOverRetireMin + 1) * 0.12;
+        const retireChance = (yearsOverRetireMin + 1) / 0.12;
         if (rng.chance(retireChance)) {
             player._retired = true;
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] BlockStatement
src/engine/PlayerDevelopment.js:152:39
     if (player.age >= curve.retireMin) {
         const yearsOverRetireMin = player.age - curve.retireMin;
         const retireChance = (yearsOverRetireMin + 1) * 0.12;
-        if (rng.chance(retireChance)) {
-            player._retired = true;
-            changes.push({ type: 'retirement', player: player.name, age: player.age });
-        }
+        if (rng.chance(retireChance)) {}
     }
     // BUG-079: safety cap — force-retire if age > 42 (probability of reaching this
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] ConditionalExpression
src/engine/PlayerDevelopment.js:152:13
     if (player.age >= curve.retireMin) {
         const yearsOverRetireMin = player.age - curve.retireMin;
         const retireChance = (yearsOverRetireMin + 1) * 0.12;
-        if (rng.chance(retireChance)) {
+        if (false) {
             player._retired = true;
             changes.push({ type: 'retirement', player: player.name, age: player.age });
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched
