[Killed] BooleanLiteral
src/engine/PlayerDevelopment.js:153:31
         const yearsOverRetireMin = player.age - curve.retireMin;
         const retireChance = (yearsOverRetireMin + 1) * 0.12;
         if (rng.chance(retireChance)) {
-            player._retired = true;
+            player._retired = false;
             changes.push({ type: 'retirement', player: player.name, age: player.age });
         }
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:154:34
         const retireChance = (yearsOverRetireMin + 1) * 0.12;
         if (rng.chance(retireChance)) {
             player._retired = true;
-            changes.push({ type: 'retirement', player: player.name, age: player.age });
+            changes.push({ type: "", player: player.name, age: player.age });
         }
     }

[Killed] ConditionalExpression
src/engine/PlayerDevelopment.js:159:29
     }
     // BUG-079: safety cap — force-retire if age > 42 (probability of reaching this
     // naturally is ~0, so any player here escaped the stochastic retirement system).
-    if (!player._retired && player.age > 42) {
+    if (!player._retired && true) {
         player._retired = true;
         changes.push({ type: 'retirement', player: player.name, age: player.age });
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] ConditionalExpression
src/engine/PlayerDevelopment.js:159:9
     }
     // BUG-079: safety cap — force-retire if age > 42 (probability of reaching this
     // naturally is ~0, so any player here escaped the stochastic retirement system).
-    if (!player._retired && player.age > 42) {
+    if (true) {
         player._retired = true;
         changes.push({ type: 'retirement', player: player.name, age: player.age });
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[NoCoverage] BooleanLiteral
src/engine/PlayerDevelopment.js:160:27
     // BUG-079: safety cap — force-retire if age > 42 (probability of reaching this
     // naturally is ~0, so any player here escaped the stochastic retirement system).
     if (!player._retired && player.age > 42) {
-        player._retired = true;
+        player._retired = false;
         changes.push({ type: 'retirement', player: player.name, age: player.age });
     }

[NoCoverage] ObjectLiteral
src/engine/PlayerDevelopment.js:161:22
     // naturally is ~0, so any player here escaped the stochastic retirement system).
     if (!player._retired && player.age > 42) {
         player._retired = true;
-        changes.push({ type: 'retirement', player: player.name, age: player.age });
+        changes.push({});
     }
 

[Killed] BlockStatement
src/engine/PlayerDevelopment.js:165:45
     }
 
     // Assign individual peak variance on first run (deterministic from id)
-    if (player._peakVariance === undefined) {
-        // Hash player id to get ±variance consistently
-        const hash = typeof player.id === 'string'
-            ? player.id.split('').reduce((h, c) => ((h << 5) - h + c.charCodeAt(0)) | 0, 0)
-            : (player.id || 0);
-        player._peakVariance = (Math.abs(hash) % (curve.peakVariance * 2 + 1)) - curve.peakVariance;
-    }
+    if (player._peakVariance === undefined) {}
 
     // Recalc OVR
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] EqualityOperator
src/engine/PlayerDevelopment.js:165:9
     }
 
     // Assign individual peak variance on first run (deterministic from id)
-    if (player._peakVariance === undefined) {
+    if (player._peakVariance !== undefined) {
         // Hash player id to get ±variance consistently
         const hash = typeof player.id === 'string'
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] EqualityOperator
src/engine/PlayerDevelopment.js:167:22
     // Assign individual peak variance on first run (deterministic from id)
     if (player._peakVariance === undefined) {
         // Hash player id to get ±variance consistently
-        const hash = typeof player.id === 'string'
+        const hash = typeof player.id !== 'string'
             ? player.id.split('').reduce((h, c) => ((h << 5) - h + c.charCodeAt(0)) | 0, 0)
             : (player.id || 0);
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] ConditionalExpression
src/engine/PlayerDevelopment.js:167:22
     // Assign individual peak variance on first run (deterministic from id)
     if (player._peakVariance === undefined) {
         // Hash player id to get ±variance consistently
-        const hash = typeof player.id === 'string'
+        const hash = true
             ? player.id.split('').reduce((h, c) => ((h << 5) - h + c.charCodeAt(0)) | 0, 0)
             : (player.id || 0);
killedBy: SPEC-025: Advanced Player Aging Young (16-21): growth occurs
statusReason: player.id.split is not a function

[Killed] ArrowFunction
src/engine/PlayerDevelopment.js:168:42
     if (player._peakVariance === undefined) {
         // Hash player id to get ±variance consistently
         const hash = typeof player.id === 'string'
-            ? player.id.split('').reduce((h, c) => ((h << 5) - h + c.charCodeAt(0)) | 0, 0)
+            ? player.id.split('').reduce(() => undefined, 0)
             : (player.id || 0);
         player._peakVariance = (Math.abs(hash) % (curve.peakVariance * 2 + 1)) - curve.peakVariance;
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] ArithmeticOperator
src/engine/PlayerDevelopment.js:168:53
     if (player._peakVariance === undefined) {
         // Hash player id to get ±variance consistently
         const hash = typeof player.id === 'string'
-            ? player.id.split('').reduce((h, c) => ((h << 5) - h + c.charCodeAt(0)) | 0, 0)
+            ? player.id.split('').reduce((h, c) => ((h << 5) + h + c.charCodeAt(0)) | 0, 0)
             : (player.id || 0);
         player._peakVariance = (Math.abs(hash) % (curve.peakVariance * 2 + 1)) - curve.peakVariance;
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Survived] ConditionalExpression
src/engine/PlayerDevelopment.js:169:16
         // Hash player id to get ±variance consistently
         const hash = typeof player.id === 'string'
             ? player.id.split('').reduce((h, c) => ((h << 5) - h + c.charCodeAt(0)) | 0, 0)
-            : (player.id || 0);
+            : (false);
         player._peakVariance = (Math.abs(hash) % (curve.peakVariance * 2 + 1)) - curve.peakVariance;
     }

[Survived] ConditionalExpression
src/engine/PlayerDevelopment.js:169:16
         // Hash player id to get ±variance consistently
         const hash = typeof player.id === 'string'
             ? player.id.split('').reduce((h, c) => ((h << 5) - h + c.charCodeAt(0)) | 0, 0)
-            : (player.id || 0);
+            : (true);
         player._peakVariance = (Math.abs(hash) % (curve.peakVariance * 2 + 1)) - curve.peakVariance;
     }

[Killed] ArithmeticOperator
src/engine/PlayerDevelopment.js:170:32
         const hash = typeof player.id === 'string'
             ? player.id.split('').reduce((h, c) => ((h << 5) - h + c.charCodeAt(0)) | 0, 0)
             : (player.id || 0);
-        player._peakVariance = (Math.abs(hash) % (curve.peakVariance * 2 + 1)) - curve.peakVariance;
+        player._peakVariance = Math.abs(hash) % (curve.peakVariance * 2 + 1) + curve.peakVariance;
     }
 
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] ArithmeticOperator
src/engine/PlayerDevelopment.js:170:33
         const hash = typeof player.id === 'string'
             ? player.id.split('').reduce((h, c) => ((h << 5) - h + c.charCodeAt(0)) | 0, 0)
             : (player.id || 0);
-        player._peakVariance = (Math.abs(hash) % (curve.peakVariance * 2 + 1)) - curve.peakVariance;
+        player._peakVariance = (Math.abs(hash) * (curve.peakVariance * 2 + 1)) - curve.peakVariance;
     }
 
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] BlockStatement
src/engine/PlayerDevelopment.js:182:33
 /**
  * Envelhece jogadores 1 ano. Chamar 1x por temporada.
  */
-export function ageSquad(squad) {
-    const events = [];
-    squad.forEach(p => {
-        p.age++;
-        if (p.age >= 35) {
-            events.push(`🎂 ${p.name} fez ${p.age} anos. A aposentadoria se aproxima.`);
-        }
-    });
-    return events;
-}
+export function ageSquad(squad) {}
 
 /**
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] BlockStatement
src/engine/PlayerDevelopment.js:184:24
  */
 export function ageSquad(squad) {
     const events = [];
-    squad.forEach(p => {
-        p.age++;
-        if (p.age >= 35) {
-            events.push(`🎂 ${p.name} fez ${p.age} anos. A aposentadoria se aproxima.`);
-        }
-    });
+    squad.forEach(p => {});
     return events;
 }
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] UpdateOperator
src/engine/PlayerDevelopment.js:185:9
 export function ageSquad(squad) {
     const events = [];
     squad.forEach(p => {
-        p.age++;
+        p.age--;
         if (p.age >= 35) {
             events.push(`🎂 ${p.name} fez ${p.age} anos. A aposentadoria se aproxima.`);
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Survived] ConditionalExpression
src/engine/PlayerDevelopment.js:186:13
     const events = [];
     squad.forEach(p => {
         p.age++;
-        if (p.age >= 35) {
+        if (true) {
             events.push(`🎂 ${p.name} fez ${p.age} anos. A aposentadoria se aproxima.`);
         }

[Survived] EqualityOperator
src/engine/PlayerDevelopment.js:186:13
     const events = [];
     squad.forEach(p => {
         p.age++;
-        if (p.age >= 35) {
+        if (p.age < 35) {
             events.push(`🎂 ${p.name} fez ${p.age} anos. A aposentadoria se aproxima.`);
         }

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:187:25
     squad.forEach(p => {
         p.age++;
         if (p.age >= 35) {
-            events.push(`🎂 ${p.name} fez ${p.age} anos. A aposentadoria se aproxima.`);
+            events.push(``;
         }
     });

[Killed] BlockStatement
src/engine/PlayerDevelopment.js:197:34
  * Form system — tracks últimas 5 participações em jogos
  * Cada jogador tem player.form = { last5: [1,0,-1,1,0], trend: 'hot'|'cold'|'normal' }
  */
-export function initForm(player) {
-    if (!player.form) {
-        player.form = { last5: [], trend: 'normal' };
-    }
-}
+export function initForm(player) {}
 
 export function updateForm(player, result) {
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Cannot read properties of undefined (reading 'last5')

[Killed] ConditionalExpression
src/engine/PlayerDevelopment.js:198:9
  * Cada jogador tem player.form = { last5: [1,0,-1,1,0], trend: 'hot'|'cold'|'normal' }
  */
 export function initForm(player) {
-    if (!player.form) {
+    if (true) {
         player.form = { last5: [], trend: 'normal' };
     }
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] BlockStatement
src/engine/PlayerDevelopment.js:198:23
  * Cada jogador tem player.form = { last5: [1,0,-1,1,0], trend: 'hot'|'cold'|'normal' }
  */
 export function initForm(player) {
-    if (!player.form) {
-        player.form = { last5: [], trend: 'normal' };
-    }
+    if (!player.form) {}
 }
 
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Cannot read properties of undefined (reading 'last5')

[Killed] BlockStatement
src/engine/PlayerDevelopment.js:203:44
     }
 }
 
-export function updateForm(player, result) {
-    initForm(player);
-    // result: 1 = bom (titular em vitória/gol), 0 = neutro, -1 = ruim (derrota)
-    player.form.last5.push(result);
-    if (player.form.last5.length > 5) player.form.last5.shift();
-
-    const avg = player.form.last5.reduce((s, v) => s + v, 0) / player.form.last5.length;
-    if (avg >= 0.6) player.form.trend = 'hot';
-    else if (avg <= -0.4) player.form.trend = 'cold';
-    else player.form.trend = 'normal';
-}
+export function updateForm(player, result) {}
 
 export function getFormEmoji(trend) {
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] ConditionalExpression
src/engine/PlayerDevelopment.js:207:9
     initForm(player);
     // result: 1 = bom (titular em vitória/gol), 0 = neutro, -1 = ruim (derrota)
     player.form.last5.push(result);
-    if (player.form.last5.length > 5) player.form.last5.shift();
+    if (true) player.form.last5.shift();
 
     const avg = player.form.last5.reduce((s, v) => s + v, 0) / player.form.last5.length;
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] EqualityOperator
src/engine/PlayerDevelopment.js:207:9
     initForm(player);
     // result: 1 = bom (titular em vitória/gol), 0 = neutro, -1 = ruim (derrota)
     player.form.last5.push(result);
-    if (player.form.last5.length > 5) player.form.last5.shift();
+    if (player.form.last5.length <= 5) player.form.last5.shift();
 
     const avg = player.form.last5.reduce((s, v) => s + v, 0) / player.form.last5.length;
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] ArithmeticOperator
src/engine/PlayerDevelopment.js:209:52
     player.form.last5.push(result);
     if (player.form.last5.length > 5) player.form.last5.shift();
 
-    const avg = player.form.last5.reduce((s, v) => s + v, 0) / player.form.last5.length;
+    const avg = player.form.last5.reduce((s, v) => s - v, 0) / player.form.last5.length;
     if (avg >= 0.6) player.form.trend = 'hot';
     else if (avg <= -0.4) player.form.trend = 'cold';
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] ArithmeticOperator
src/engine/PlayerDevelopment.js:209:17
     player.form.last5.push(result);
     if (player.form.last5.length > 5) player.form.last5.shift();
 
-    const avg = player.form.last5.reduce((s, v) => s + v, 0) / player.form.last5.length;
+    const avg = player.form.last5.reduce((s, v) => s + v, 0) * player.form.last5.length;
     if (avg >= 0.6) player.form.trend = 'hot';
     else if (avg <= -0.4) player.form.trend = 'cold';
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] ConditionalExpression
src/engine/PlayerDevelopment.js:210:9
     if (player.form.last5.length > 5) player.form.last5.shift();
 
     const avg = player.form.last5.reduce((s, v) => s + v, 0) / player.form.last5.length;
-    if (avg >= 0.6) player.form.trend = 'hot';
+    if (true) player.form.trend = 'hot';
     else if (avg <= -0.4) player.form.trend = 'cold';
     else player.form.trend = 'normal';
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] ConditionalExpression
src/engine/PlayerDevelopment.js:210:9
     if (player.form.last5.length > 5) player.form.last5.shift();
 
     const avg = player.form.last5.reduce((s, v) => s + v, 0) / player.form.last5.length;
-    if (avg >= 0.6) player.form.trend = 'hot';
+    if (false) player.form.trend = 'hot';
     else if (avg <= -0.4) player.form.trend = 'cold';
     else player.form.trend = 'normal';
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] EqualityOperator
src/engine/PlayerDevelopment.js:211:14
 
     const avg = player.form.last5.reduce((s, v) => s + v, 0) / player.form.last5.length;
     if (avg >= 0.6) player.form.trend = 'hot';
-    else if (avg <= -0.4) player.form.trend = 'cold';
+    else if (avg > -0.4) player.form.trend = 'cold';
     else player.form.trend = 'normal';
 }
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] ConditionalExpression
src/engine/PlayerDevelopment.js:211:14
 
     const avg = player.form.last5.reduce((s, v) => s + v, 0) / player.form.last5.length;
     if (avg >= 0.6) player.form.trend = 'hot';
-    else if (avg <= -0.4) player.form.trend = 'cold';
+    else if (true) player.form.trend = 'cold';
     else player.form.trend = 'normal';
 }
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[NoCoverage] BlockStatement
src/engine/PlayerDevelopment.js:215:37
     else player.form.trend = 'normal';
 }
 
-export function getFormEmoji(trend) {
-    if (trend === 'hot') return '🔥';
-    if (trend === 'cold') return '❄️';
-    return '';
-}
+export function getFormEmoji(trend) {}
 
 export function getFormModifier(trend) {

[NoCoverage] ConditionalExpression
src/engine/PlayerDevelopment.js:216:9
 }
 
 export function getFormEmoji(trend) {
-    if (trend === 'hot') return '🔥';
+    if (true) return '🔥';
     if (trend === 'cold') return '❄️';
     return '';

[NoCoverage] EqualityOperator
src/engine/PlayerDevelopment.js:216:9
 }
 
 export function getFormEmoji(trend) {
-    if (trend === 'hot') return '🔥';
+    if (trend !== 'hot') return '🔥';
     if (trend === 'cold') return '❄️';
     return '';

[NoCoverage] EqualityOperator
src/engine/PlayerDevelopment.js:217:9
 
 export function getFormEmoji(trend) {
     if (trend === 'hot') return '🔥';
-    if (trend === 'cold') return '❄️';
+    if (trend !== 'cold') return '❄️';
     return '';
 }

[NoCoverage] ConditionalExpression
src/engine/PlayerDevelopment.js:217:9
 
 export function getFormEmoji(trend) {
     if (trend === 'hot') return '🔥';
-    if (trend === 'cold') return '❄️';
+    if (false) return '❄️';
     return '';
 }

[NoCoverage] StringLiteral
src/engine/PlayerDevelopment.js:218:12
 export function getFormEmoji(trend) {
     if (trend === 'hot') return '🔥';
     if (trend === 'cold') return '❄️';
-    return '';
+    return "Stryker was here!";
 }
 

[Killed] BlockStatement
src/engine/PlayerDevelopment.js:221:40
     return '';
 }
 
-export function getFormModifier(trend) {
-    if (trend === 'hot') return 1.08;   // +8% em performance
-    if (trend === 'cold') return 0.92;  // -8%
-    return 1.0;
-}
+export function getFormModifier(trend) {}
 
 /**
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] EqualityOperator
src/engine/PlayerDevelopment.js:222:9
 }
 
 export function getFormModifier(trend) {
-    if (trend === 'hot') return 1.08;   // +8% em performance
+    if (trend !== 'hot') return 1.08;   // +8% em performance
     if (trend === 'cold') return 0.92;  // -8%
     return 1.0;
killedBy: SPEC-003: Player Development getFormModifier returns multiplier
statusReason: expected 1 to be greater than 1.08

[Killed] ConditionalExpression
src/engine/PlayerDevelopment.js:222:9
 }
 
 export function getFormModifier(trend) {
-    if (trend === 'hot') return 1.08;   // +8% em performance
+    if (false) return 1.08;   // +8% em performance
     if (trend === 'cold') return 0.92;  // -8%
     return 1.0;
killedBy: SPEC-003: Player Development getFormModifier returns multiplier
statusReason: expected 1 to be greater than 1

[Killed] ConditionalExpression
src/engine/PlayerDevelopment.js:223:9
 
 export function getFormModifier(trend) {
     if (trend === 'hot') return 1.08;   // +8% em performance
-    if (trend === 'cold') return 0.92;  // -8%
+    if (false) return 0.92;  // -8%
     return 1.0;
 }
killedBy: SPEC-003: Player Development getFormModifier returns multiplier
statusReason: expected 1 to be less than 1

[Killed] ConditionalExpression
src/engine/PlayerDevelopment.js:223:9
 
 export function getFormModifier(trend) {
     if (trend === 'hot') return 1.08;   // +8% em performance
-    if (trend === 'cold') return 0.92;  // -8%
+    if (true) return 0.92;  // -8%
     return 1.0;
 }
killedBy: SPEC-003: Player Development getFormModifier returns multiplier
statusReason: expected 0.92 to be less than 0.92

[Killed] MethodExpression
src/engine/PlayerDevelopment.js:237:24
     const events = [];
 
     // Find leader
-    const candidates = squad
-        .filter(p => p.age >= 28 && (p.moral || 50) >= 65 && !p.injury)
+    const candidates = squad
         .sort((a, b) => (b.moral || 50) - (a.moral || 50));
     const leader = candidates[0] || null;
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Survived] MethodExpression
src/engine/PlayerDevelopment.js:237:24
     const events = [];
 
     // Find leader
-    const candidates = squad
-        .filter(p => p.age >= 28 && (p.moral || 50) >= 65 && !p.injury)
-        .sort((a, b) => (b.moral || 50) - (a.moral || 50));
+    const candidates = squad.filter(p => p.age >= 28 && (p.moral || 50) >= 65 && !p.injury);
     const leader = candidates[0] || null;
 

[Killed] ConditionalExpression
src/engine/PlayerDevelopment.js:238:22
 
     // Find leader
     const candidates = squad
-        .filter(p => p.age >= 28 && (p.moral || 50) >= 65 && !p.injury)
+        .filter(p => true)
         .sort((a, b) => (b.moral || 50) - (a.moral || 50));
     const leader = candidates[0] || null;
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] ConditionalExpression
src/engine/PlayerDevelopment.js:238:22
 
     // Find leader
     const candidates = squad
-        .filter(p => p.age >= 28 && (p.moral || 50) >= 65 && !p.injury)
+        .filter(p => true && !p.injury)
         .sort((a, b) => (b.moral || 50) - (a.moral || 50));
     const leader = candidates[0] || null;
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Survived] ConditionalExpression
src/engine/PlayerDevelopment.js:239:44
     // Find leader
     const candidates = squad
         .filter(p => p.age >= 28 && (p.moral || 50) >= 65 && !p.injury)
-        .sort((a, b) => (b.moral || 50) - (a.moral || 50));
+        .sort((a, b) => (b.moral || 50) - (true));
     const leader = candidates[0] || null;
 

[Survived] ConditionalExpression
src/engine/PlayerDevelopment.js:239:26
     // Find leader
     const candidates = squad
         .filter(p => p.age >= 28 && (p.moral || 50) >= 65 && !p.injury)
-        .sort((a, b) => (b.moral || 50) - (a.moral || 50));
+        .sort((a, b) => (true) - (a.moral || 50));
     const leader = candidates[0] || null;
 

[Killed] ConditionalExpression
src/engine/PlayerDevelopment.js:240:20
     const candidates = squad
         .filter(p => p.age >= 28 && (p.moral || 50) >= 65 && !p.injury)
         .sort((a, b) => (b.moral || 50) - (a.moral || 50));
-    const leader = candidates[0] || null;
+    const leader = true;
 
     // Count unhappy players
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Cannot create property '_isCaptain' on boolean 'true'

[Survived] LogicalOperator
src/engine/PlayerDevelopment.js:240:20
     const candidates = squad
         .filter(p => p.age >= 28 && (p.moral || 50) >= 65 && !p.injury)
         .sort((a, b) => (b.moral || 50) - (a.moral || 50));
-    const leader = candidates[0] || null;
+    const leader = candidates[0] && null;
 
     // Count unhappy players

[Killed] ConditionalExpression
src/engine/PlayerDevelopment.js:243:39
     const leader = candidates[0] || null;
 
     // Count unhappy players
-    const unhappy = squad.filter(p => (p.moral || 50) < 30 && !p.injury);
+    const unhappy = squad.filter(p => true);
     const happy = squad.filter(p => (p.moral || 50) > 75);
 
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] ConditionalExpression
src/engine/PlayerDevelopment.js:243:39
     const leader = candidates[0] || null;
 
     // Count unhappy players
-    const unhappy = squad.filter(p => (p.moral || 50) < 30 && !p.injury);
+    const unhappy = squad.filter(p => true && !p.injury);
     const happy = squad.filter(p => (p.moral || 50) > 75);
 
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] ConditionalExpression
src/engine/PlayerDevelopment.js:244:38
 
     // Count unhappy players
     const unhappy = squad.filter(p => (p.moral || 50) < 30 && !p.injury);
-    const happy = squad.filter(p => (p.moral || 50) > 75);
+    const happy = squad.filter(p => (true) > 75);
 
     // Leader stabilizes
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] EqualityOperator
src/engine/PlayerDevelopment.js:244:37
 
     // Count unhappy players
     const unhappy = squad.filter(p => (p.moral || 50) < 30 && !p.injury);
-    const happy = squad.filter(p => (p.moral || 50) > 75);
+    const happy = squad.filter(p => (p.moral || 50) <= 75);
 
     // Leader stabilizes
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Killed] ConditionalExpression
src/engine/PlayerDevelopment.js:247:9
     const happy = squad.filter(p => (p.moral || 50) > 75);
 
     // Leader stabilizes
-    if (leader && unhappy.length > 0 && unhappy.length <= 3) {
+    if (true) {
         unhappy.forEach(p => {
             p.moral = Math.min(100, (p.moral || 50) + 3);
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Cannot read properties of null (reading 'name')
