[Killed] ConditionalExpression
src/engine/PlayerDevelopment.js:247:9
     const happy = squad.filter(p => (p.moral || 50) > 75);
 
     // Leader stabilizes
-    if (leader && unhappy.length > 0 && unhappy.length <= 3) {
+    if (true && unhappy.length <= 3) {
         unhappy.forEach(p => {
             p.moral = Math.min(100, (p.moral || 50) + 3);
killedBy: System Integration: full season simulation completes 2 full seasons without errors
statusReason: expected 1 to be greater than or equal to 3

[NoCoverage] BlockStatement
src/engine/PlayerDevelopment.js:248:30
 
     // Leader stabilizes
     if (leader && unhappy.length > 0 && unhappy.length <= 3) {
-        unhappy.forEach(p => {
-            p.moral = Math.min(100, (p.moral || 50) + 3);
-        });
+        unhappy.forEach(p => {});
         events.push(`👔 ${leader.name} conversou com jogadores insatisfeitos. Moral melhorou.`);
     }

[NoCoverage] LogicalOperator
src/engine/PlayerDevelopment.js:249:38
     // Leader stabilizes
     if (leader && unhappy.length > 0 && unhappy.length <= 3) {
         unhappy.forEach(p => {
-            p.moral = Math.min(100, (p.moral || 50) + 3);
+            p.moral = Math.min(100, (p.moral && 50) + 3);
         });
         events.push(`👔 ${leader.name} conversou com jogadores insatisfeitos. Moral melhorou.`);

[NoCoverage] ConditionalExpression
src/engine/PlayerDevelopment.js:249:38
     // Leader stabilizes
     if (leader && unhappy.length > 0 && unhappy.length <= 3) {
         unhappy.forEach(p => {
-            p.moral = Math.min(100, (p.moral || 50) + 3);
+            p.moral = Math.min(100, (true) + 3);
         });
         events.push(`👔 ${leader.name} conversou com jogadores insatisfeitos. Moral melhorou.`);

[Killed] ConditionalExpression
src/engine/PlayerDevelopment.js:255:9
     }
 
     // Cancer effect: if 4+ unhappy, they drag others down
-    if (unhappy.length >= 4) {
+    if (true) {
         squad.forEach(p => {
             if ((p.moral || 50) > 40) {
killedBy: Engine Golden Master (5 seasons, seed=42) 5-season simulation snapshot is deterministic
statusReason: Snapshot `Engine Golden Master (5 seasons, seed=42) > 5-season simulation snapshot is deterministic 1` mismatched

[Survived] EqualityOperator
src/engine/PlayerDevelopment.js:255:9
     }
 
     // Cancer effect: if 4+ unhappy, they drag others down
-    if (unhappy.length >= 4) {
+    if (unhappy.length < 4) {
         squad.forEach(p => {
             if ((p.moral || 50) > 40) {

[Survived] BlockStatement
src/engine/PlayerDevelopment.js:256:28
 
     // Cancer effect: if 4+ unhappy, they drag others down
     if (unhappy.length >= 4) {
-        squad.forEach(p => {
-            if ((p.moral || 50) > 40) {
-                p.moral = Math.max(0, (p.moral || 50) - 2);
-            }
-        });
+        squad.forEach(p => {});
         events.push(`☠️ Vestiário em crise! ${unhappy.length} jogadores insatisfeitos contaminam o grupo.`);
     }

[Survived] EqualityOperator
src/engine/PlayerDevelopment.js:257:17
     // Cancer effect: if 4+ unhappy, they drag others down
     if (unhappy.length >= 4) {
         squad.forEach(p => {
-            if ((p.moral || 50) > 40) {
+            if ((p.moral || 50) >= 40) {
                 p.moral = Math.max(0, (p.moral || 50) - 2);
             }

[Survived] LogicalOperator
src/engine/PlayerDevelopment.js:257:18
     // Cancer effect: if 4+ unhappy, they drag others down
     if (unhappy.length >= 4) {
         squad.forEach(p => {
-            if ((p.moral || 50) > 40) {
+            if ((p.moral && 50) > 40) {
                 p.moral = Math.max(0, (p.moral || 50) - 2);
             }

[Survived] MethodExpression
src/engine/PlayerDevelopment.js:258:27
     if (unhappy.length >= 4) {
         squad.forEach(p => {
             if ((p.moral || 50) > 40) {
-                p.moral = Math.max(0, (p.moral || 50) - 2);
+                p.moral = Math.min(0, (p.moral || 50) - 2);
             }
         });

[Survived] ArithmeticOperator
src/engine/PlayerDevelopment.js:258:39
     if (unhappy.length >= 4) {
         squad.forEach(p => {
             if ((p.moral || 50) > 40) {
-                p.moral = Math.max(0, (p.moral || 50) - 2);
+                p.moral = Math.max(0, (p.moral || 50) + 2);
             }
         });

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:261:21
                 p.moral = Math.max(0, (p.moral || 50) - 2);
             }
         });
-        events.push(`☠️ Vestiário em crise! ${unhappy.length} jogadores insatisfeitos contaminam o grupo.`);
+        events.push(``);
     }
 

[Survived] EqualityOperator
src/engine/PlayerDevelopment.js:265:9
     }
 
     // Good vibes: if 6+ happy, slight boost to everyone
-    if (happy.length >= 6) {
+    if (happy.length > 6) {
         squad.forEach(p => {
             p.moral = Math.min(100, (p.moral || 50) + 1);

[Survived] ConditionalExpression
src/engine/PlayerDevelopment.js:265:9
     }
 
     // Good vibes: if 6+ happy, slight boost to everyone
-    if (happy.length >= 6) {
+    if (true) {
         squad.forEach(p => {
             p.moral = Math.min(100, (p.moral || 50) + 1);

[Survived] BlockStatement
src/engine/PlayerDevelopment.js:266:28
 
     // Good vibes: if 6+ happy, slight boost to everyone
     if (happy.length >= 6) {
-        squad.forEach(p => {
-            p.moral = Math.min(100, (p.moral || 50) + 1);
-        });
+        squad.forEach(p => {});
         events.push(`🎉 Clima excelente no vestiário! ${happy.length} jogadores em alta moral.`);
     }

[Survived] MethodExpression
src/engine/PlayerDevelopment.js:267:23
     // Good vibes: if 6+ happy, slight boost to everyone
     if (happy.length >= 6) {
         squad.forEach(p => {
-            p.moral = Math.min(100, (p.moral || 50) + 1);
+            p.moral = Math.max(100, (p.moral || 50) + 1);
         });
         events.push(`🎉 Clima excelente no vestiário! ${happy.length} jogadores em alta moral.`);

[Survived] ArithmeticOperator
src/engine/PlayerDevelopment.js:267:37
     // Good vibes: if 6+ happy, slight boost to everyone
     if (happy.length >= 6) {
         squad.forEach(p => {
-            p.moral = Math.min(100, (p.moral || 50) + 1);
+            p.moral = Math.min(100, (p.moral || 50) - 1);
         });
         events.push(`🎉 Clima excelente no vestiário! ${happy.length} jogadores em alta moral.`);

[Survived] ConditionalExpression
src/engine/PlayerDevelopment.js:273:9
     }
 
     // Captain system: highest OVR veteran gets +2 moral stability
-    if (leader) {
+    if (false) {
         leader._isCaptain = true;
     }

[Survived] ConditionalExpression
src/engine/PlayerDevelopment.js:273:9
     }
 
     // Captain system: highest OVR veteran gets +2 moral stability
-    if (leader) {
+    if (true) {
         leader._isCaptain = true;
     }

[Survived] BooleanLiteral
src/engine/PlayerDevelopment.js:274:29
 
     // Captain system: highest OVR veteran gets +2 moral stability
     if (leader) {
-        leader._isCaptain = true;
+        leader._isCaptain = false;
     }
 

[Survived] ObjectLiteral
src/engine/PlayerDevelopment.js:277:12
         leader._isCaptain = true;
     }
 
-    return { events, leader };
+    return {};
 }
 

[NoCoverage] BlockStatement
src/engine/PlayerDevelopment.js:283:46
 /**
  * Contract Renewal — negociação de renovação
  */
-export function generateRenewalOffer(player) {
-    const baseSalary = player.salary || 5000;
-    const ageFactor = player.age > 30 ? 0.8 : player.age < 22 ? 1.5 : 1.2;
-    const formFactor = player.form?.trend === 'hot' ? 1.3 : player.form?.trend === 'cold' ? 0.9 : 1.0;
-    const personalityFactor = player.personality === 'Ambicioso' ? 1.4 : player.personality === 'Profissional' ? 1.0 : 1.1;
-
-    const demandedSalary = Math.floor(baseSalary * ageFactor * formFactor * personalityFactor);
-    const weeks = player.age > 30 ? 38 : player.age < 22 ? 114 : 76; // 1, 2, or 3 seasons
-
-    // Happiness affects willingness
-    const willRenew = (player.moral || 50) > 30;
-
-    return {
-        playerId: player.id,
-        playerName: player.name,
-        currentSalary: baseSalary,
-        demandedSalary,
-        weeks,
-        willRenew,
-        personality: player.personality || 'Normal',
-        reason: !willRenew ? `${player.name} está insatisfeito e recusa renovar.` : null,
-    };
-}
+export function generateRenewalOffer(player) {}
 
 export function acceptRenewal(player, offer) {

[NoCoverage] ConditionalExpression
src/engine/PlayerDevelopment.js:284:24
  * Contract Renewal — negociação de renovação
  */
 export function generateRenewalOffer(player) {
-    const baseSalary = player.salary || 5000;
+    const baseSalary = true;
     const ageFactor = player.age > 30 ? 0.8 : player.age < 22 ? 1.5 : 1.2;
     const formFactor = player.form?.trend === 'hot' ? 1.3 : player.form?.trend === 'cold' ? 0.9 : 1.0;

[NoCoverage] ConditionalExpression
src/engine/PlayerDevelopment.js:284:24
  * Contract Renewal — negociação de renovação
  */
 export function generateRenewalOffer(player) {
-    const baseSalary = player.salary || 5000;
+    const baseSalary = false;
     const ageFactor = player.age > 30 ? 0.8 : player.age < 22 ? 1.5 : 1.2;
     const formFactor = player.form?.trend === 'hot' ? 1.3 : player.form?.trend === 'cold' ? 0.9 : 1.0;

[NoCoverage] ConditionalExpression
src/engine/PlayerDevelopment.js:285:47
  */
 export function generateRenewalOffer(player) {
     const baseSalary = player.salary || 5000;
-    const ageFactor = player.age > 30 ? 0.8 : player.age < 22 ? 1.5 : 1.2;
+    const ageFactor = player.age > 30 ? 0.8 : false ? 1.5 : 1.2;
     const formFactor = player.form?.trend === 'hot' ? 1.3 : player.form?.trend === 'cold' ? 0.9 : 1.0;
     const personalityFactor = player.personality === 'Ambicioso' ? 1.4 : player.personality === 'Profissional' ? 1.0 : 1.1;

[NoCoverage] EqualityOperator
src/engine/PlayerDevelopment.js:285:47
  */
 export function generateRenewalOffer(player) {
     const baseSalary = player.salary || 5000;
-    const ageFactor = player.age > 30 ? 0.8 : player.age < 22 ? 1.5 : 1.2;
+    const ageFactor = player.age > 30 ? 0.8 : player.age <= 22 ? 1.5 : 1.2;
     const formFactor = player.form?.trend === 'hot' ? 1.3 : player.form?.trend === 'cold' ? 0.9 : 1.0;
     const personalityFactor = player.personality === 'Ambicioso' ? 1.4 : player.personality === 'Profissional' ? 1.0 : 1.1;

[NoCoverage] ConditionalExpression
src/engine/PlayerDevelopment.js:286:24
 export function generateRenewalOffer(player) {
     const baseSalary = player.salary || 5000;
     const ageFactor = player.age > 30 ? 0.8 : player.age < 22 ? 1.5 : 1.2;
-    const formFactor = player.form?.trend === 'hot' ? 1.3 : player.form?.trend === 'cold' ? 0.9 : 1.0;
+    const formFactor = true ? 1.3 : player.form?.trend === 'cold' ? 0.9 : 1.0;
     const personalityFactor = player.personality === 'Ambicioso' ? 1.4 : player.personality === 'Profissional' ? 1.0 : 1.1;
 

[NoCoverage] EqualityOperator
src/engine/PlayerDevelopment.js:286:24
 export function generateRenewalOffer(player) {
     const baseSalary = player.salary || 5000;
     const ageFactor = player.age > 30 ? 0.8 : player.age < 22 ? 1.5 : 1.2;
-    const formFactor = player.form?.trend === 'hot' ? 1.3 : player.form?.trend === 'cold' ? 0.9 : 1.0;
+    const formFactor = player.form?.trend !== 'hot' ? 1.3 : player.form?.trend === 'cold' ? 0.9 : 1.0;
     const personalityFactor = player.personality === 'Ambicioso' ? 1.4 : player.personality === 'Profissional' ? 1.0 : 1.1;
 

[NoCoverage] ConditionalExpression
src/engine/PlayerDevelopment.js:287:31
     const baseSalary = player.salary || 5000;
     const ageFactor = player.age > 30 ? 0.8 : player.age < 22 ? 1.5 : 1.2;
     const formFactor = player.form?.trend === 'hot' ? 1.3 : player.form?.trend === 'cold' ? 0.9 : 1.0;
-    const personalityFactor = player.personality === 'Ambicioso' ? 1.4 : player.personality === 'Profissional' ? 1.0 : 1.1;
+    const personalityFactor = true ? 1.4 : player.personality === 'Profissional' ? 1.0 : 1.1;
 
     const demandedSalary = Math.floor(baseSalary * ageFactor * formFactor * personalityFactor);

[NoCoverage] ConditionalExpression
src/engine/PlayerDevelopment.js:287:31
     const baseSalary = player.salary || 5000;
     const ageFactor = player.age > 30 ? 0.8 : player.age < 22 ? 1.5 : 1.2;
     const formFactor = player.form?.trend === 'hot' ? 1.3 : player.form?.trend === 'cold' ? 0.9 : 1.0;
-    const personalityFactor = player.personality === 'Ambicioso' ? 1.4 : player.personality === 'Profissional' ? 1.0 : 1.1;
+    const personalityFactor = false ? 1.4 : player.personality === 'Profissional' ? 1.0 : 1.1;
 
     const demandedSalary = Math.floor(baseSalary * ageFactor * formFactor * personalityFactor);

[NoCoverage] ArithmeticOperator
src/engine/PlayerDevelopment.js:289:39
     const formFactor = player.form?.trend === 'hot' ? 1.3 : player.form?.trend === 'cold' ? 0.9 : 1.0;
     const personalityFactor = player.personality === 'Ambicioso' ? 1.4 : player.personality === 'Profissional' ? 1.0 : 1.1;
 
-    const demandedSalary = Math.floor(baseSalary * ageFactor * formFactor * personalityFactor);
+    const demandedSalary = Math.floor(baseSalary * ageFactor * formFactor / personalityFactor);
     const weeks = player.age > 30 ? 38 : player.age < 22 ? 114 : 76; // 1, 2, or 3 seasons
 

[NoCoverage] ArithmeticOperator
src/engine/PlayerDevelopment.js:289:39
     const formFactor = player.form?.trend === 'hot' ? 1.3 : player.form?.trend === 'cold' ? 0.9 : 1.0;
     const personalityFactor = player.personality === 'Ambicioso' ? 1.4 : player.personality === 'Profissional' ? 1.0 : 1.1;
 
-    const demandedSalary = Math.floor(baseSalary * ageFactor * formFactor * personalityFactor);
+    const demandedSalary = Math.floor(baseSalary * ageFactor / formFactor * personalityFactor);
     const weeks = player.age > 30 ? 38 : player.age < 22 ? 114 : 76; // 1, 2, or 3 seasons
 

[NoCoverage] EqualityOperator
src/engine/PlayerDevelopment.js:290:19
     const personalityFactor = player.personality === 'Ambicioso' ? 1.4 : player.personality === 'Profissional' ? 1.0 : 1.1;
 
     const demandedSalary = Math.floor(baseSalary * ageFactor * formFactor * personalityFactor);
-    const weeks = player.age > 30 ? 38 : player.age < 22 ? 114 : 76; // 1, 2, or 3 seasons
+    const weeks = player.age <= 30 ? 38 : player.age < 22 ? 114 : 76; // 1, 2, or 3 seasons
 
     // Happiness affects willingness

[NoCoverage] ConditionalExpression
src/engine/PlayerDevelopment.js:290:19
     const personalityFactor = player.personality === 'Ambicioso' ? 1.4 : player.personality === 'Profissional' ? 1.0 : 1.1;
 
     const demandedSalary = Math.floor(baseSalary * ageFactor * formFactor * personalityFactor);
-    const weeks = player.age > 30 ? 38 : player.age < 22 ? 114 : 76; // 1, 2, or 3 seasons
+    const weeks = false ? 38 : player.age < 22 ? 114 : 76; // 1, 2, or 3 seasons
 
     // Happiness affects willingness

[NoCoverage] EqualityOperator
src/engine/PlayerDevelopment.js:293:23
     const weeks = player.age > 30 ? 38 : player.age < 22 ? 114 : 76; // 1, 2, or 3 seasons
 
     // Happiness affects willingness
-    const willRenew = (player.moral || 50) > 30;
+    const willRenew = (player.moral || 50) >= 30;
 
     return {

[NoCoverage] LogicalOperator
src/engine/PlayerDevelopment.js:293:24
     const weeks = player.age > 30 ? 38 : player.age < 22 ? 114 : 76; // 1, 2, or 3 seasons
 
     // Happiness affects willingness
-    const willRenew = (player.moral || 50) > 30;
+    const willRenew = (player.moral && 50) > 30;
 
     return {

[NoCoverage] ConditionalExpression
src/engine/PlayerDevelopment.js:302:22
         demandedSalary,
         weeks,
         willRenew,
-        personality: player.personality || 'Normal',
+        personality: true,
         reason: !willRenew ? `${player.name} está insatisfeito e recusa renovar.` : null,
     };

[NoCoverage] ConditionalExpression
src/engine/PlayerDevelopment.js:302:22
         demandedSalary,
         weeks,
         willRenew,
-        personality: player.personality || 'Normal',
+        personality: false,
         reason: !willRenew ? `${player.name} está insatisfeito e recusa renovar.` : null,
     };

[NoCoverage] BooleanLiteral
src/engine/PlayerDevelopment.js:303:17
         weeks,
         willRenew,
         personality: player.personality || 'Normal',
-        reason: !willRenew ? `${player.name} está insatisfeito e recusa renovar.` : null,
+        reason: willRenew ? `${player.name} está insatisfeito e recusa renovar.` : null,
     };
 }

[NoCoverage] BlockStatement
src/engine/PlayerDevelopment.js:307:46
     };
 }
 
-export function acceptRenewal(player, offer) {
-    player.contract = { weeksLeft: offer.weeks, salary: offer.demandedSalary };
-    player.salary = offer.demandedSalary;
-    player.moral = Math.min(100, (player.moral || 50) + 10);
-    return { success: true, msg: `${player.name} renovou por ${offer.weeks} semanas (R$ ${(offer.demandedSalary / 1000).toFixed(0)}K/sem)!` };
-}
+export function acceptRenewal(player, offer) {}
 
 /**

[NoCoverage] MethodExpression
src/engine/PlayerDevelopment.js:310:20
 export function acceptRenewal(player, offer) {
     player.contract = { weeksLeft: offer.weeks, salary: offer.demandedSalary };
     player.salary = offer.demandedSalary;
-    player.moral = Math.min(100, (player.moral || 50) + 10);
+    player.moral = Math.max(100, (player.moral || 50) + 10);
     return { success: true, msg: `${player.name} renovou por ${offer.weeks} semanas (R$ ${(offer.demandedSalary / 1000).toFixed(0)}K/sem)!` };
 }

[NoCoverage] LogicalOperator
src/engine/PlayerDevelopment.js:310:35
 export function acceptRenewal(player, offer) {
     player.contract = { weeksLeft: offer.weeks, salary: offer.demandedSalary };
     player.salary = offer.demandedSalary;
-    player.moral = Math.min(100, (player.moral || 50) + 10);
+    player.moral = Math.min(100, (player.moral && 50) + 10);
     return { success: true, msg: `${player.name} renovou por ${offer.weeks} semanas (R$ ${(offer.demandedSalary / 1000).toFixed(0)}K/sem)!` };
 }

[NoCoverage] BooleanLiteral
src/engine/PlayerDevelopment.js:311:23
     player.contract = { weeksLeft: offer.weeks, salary: offer.demandedSalary };
     player.salary = offer.demandedSalary;
     player.moral = Math.min(100, (player.moral || 50) + 10);
-    return { success: true, msg: `${player.name} renovou por ${offer.weeks} semanas (R$ ${(offer.demandedSalary / 1000).toFixed(0)}K/sem)!` };
+    return { success: false, msg: `${player.name} renovou por ${offer.weeks} semanas (R$ ${(offer.demandedSalary / 1000).toFixed(0)}K/sem)!` };
 }
 

[NoCoverage] ArithmeticOperator
src/engine/PlayerDevelopment.js:311:92
     player.contract = { weeksLeft: offer.weeks, salary: offer.demandedSalary };
     player.salary = offer.demandedSalary;
     player.moral = Math.min(100, (player.moral || 50) + 10);
-    return { success: true, msg: `${player.name} renovou por ${offer.weeks} semanas (R$ ${(offer.demandedSalary / 1000).toFixed(0)}K/sem)!` };
+    return { success: true, msg: `${player.name} renovou por ${offer.weeks} semanas (R$ ${(offer.demandedSalary * 1000).toFixed(0)}K/sem)!` };
 }
 

[Survived] ObjectLiteral
src/engine/PlayerDevelopment.js:321:17
 export const TACTIC_COUNTERS = {
     // [attacker][defender] = modifier
     normal:     { normal: 1.0, offensive: 1.0, defensive: 1.0, pressing: 1.0, counter: 1.0, possession: 1.0 },
-    offensive:  { normal: 1.1, offensive: 1.0, defensive: 0.7, pressing: 1.15, counter: 0.8, possession: 1.1 },
+    offensive:  {},
     defensive:  { normal: 0.9, offensive: 1.3, defensive: 1.0, pressing: 0.9, counter: 1.1, possession: 0.85 },
     pressing:   { normal: 1.05, offensive: 0.85, defensive: 1.1, pressing: 1.0, counter: 0.7, possession: 1.2 },

[Survived] ObjectLiteral
src/engine/PlayerDevelopment.js:322:17
     // [attacker][defender] = modifier
     normal:     { normal: 1.0, offensive: 1.0, defensive: 1.0, pressing: 1.0, counter: 1.0, possession: 1.0 },
     offensive:  { normal: 1.1, offensive: 1.0, defensive: 0.7, pressing: 1.15, counter: 0.8, possession: 1.1 },
-    defensive:  { normal: 0.9, offensive: 1.3, defensive: 1.0, pressing: 0.9, counter: 1.1, possession: 0.85 },
+    defensive:  {},
     pressing:   { normal: 1.05, offensive: 0.85, defensive: 1.1, pressing: 1.0, counter: 0.7, possession: 1.2 },
     counter:    { normal: 1.0, offensive: 1.2, defensive: 0.9, pressing: 1.3, counter: 1.0, possession: 0.9 },

[Survived] ObjectLiteral
src/engine/PlayerDevelopment.js:323:17
     normal:     { normal: 1.0, offensive: 1.0, defensive: 1.0, pressing: 1.0, counter: 1.0, possession: 1.0 },
     offensive:  { normal: 1.1, offensive: 1.0, defensive: 0.7, pressing: 1.15, counter: 0.8, possession: 1.1 },
     defensive:  { normal: 0.9, offensive: 1.3, defensive: 1.0, pressing: 0.9, counter: 1.1, possession: 0.85 },
-    pressing:   { normal: 1.05, offensive: 0.85, defensive: 1.1, pressing: 1.0, counter: 0.7, possession: 1.2 },
+    pressing:   {},
     counter:    { normal: 1.0, offensive: 1.2, defensive: 0.9, pressing: 1.3, counter: 1.0, possession: 0.9 },
     possession: { normal: 1.0, offensive: 0.9, defensive: 1.15, pressing: 0.8, counter: 1.1, possession: 1.0 },

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:335:74
 export const TACTIC_NARRATION = {
     normal: {
         chance: [
-            "{atk} arma jogada pelo meio!", "{atk} tenta triangulação!", "{atk} avança pela intermediária!",
+            "{atk} arma jogada pelo meio!", "{atk} tenta triangulação!", "",
             "{atk} cria oportunidade!", "{atk} chega com perigo!", "{atk} acelera o jogo!",
             "{atk} tabela e abre espaço!", "{atk} infiltra na área!", "{atk} encontra brecha na defesa!",

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:336:41
     normal: {
         chance: [
             "{atk} arma jogada pelo meio!", "{atk} tenta triangulação!", "{atk} avança pela intermediária!",
-            "{atk} cria oportunidade!", "{atk} chega com perigo!", "{atk} acelera o jogo!",
+            "{atk} cria oportunidade!", "", "{atk} acelera o jogo!",
             "{atk} tabela e abre espaço!", "{atk} infiltra na área!", "{atk} encontra brecha na defesa!",
             "{atk} testa o goleiro do {def}!", "{atk} cruza com perigo!", "{atk} chega na linha de fundo!"

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:337:71
         chance: [
             "{atk} arma jogada pelo meio!", "{atk} tenta triangulação!", "{atk} avança pela intermediária!",
             "{atk} cria oportunidade!", "{atk} chega com perigo!", "{atk} acelera o jogo!",
-            "{atk} tabela e abre espaço!", "{atk} infiltra na área!", "{atk} encontra brecha na defesa!",
+            "{atk} tabela e abre espaço!", "{atk} infiltra na área!", "",
             "{atk} testa o goleiro do {def}!", "{atk} cruza com perigo!", "{atk} chega na linha de fundo!"
         ],

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:338:48
             "{atk} arma jogada pelo meio!", "{atk} tenta triangulação!", "{atk} avança pela intermediária!",
             "{atk} cria oportunidade!", "{atk} chega com perigo!", "{atk} acelera o jogo!",
             "{atk} tabela e abre espaço!", "{atk} infiltra na área!", "{atk} encontra brecha na defesa!",
-            "{atk} testa o goleiro do {def}!", "{atk} cruza com perigo!", "{atk} chega na linha de fundo!"
+            "{atk} testa o goleiro do {def}!", "", "{atk} chega na linha de fundo!"
         ],
         goal: [

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:338:75
             "{atk} arma jogada pelo meio!", "{atk} tenta triangulação!", "{atk} avança pela intermediária!",
             "{atk} cria oportunidade!", "{atk} chega com perigo!", "{atk} acelera o jogo!",
             "{atk} tabela e abre espaço!", "{atk} infiltra na área!", "{atk} encontra brecha na defesa!",
-            "{atk} testa o goleiro do {def}!", "{atk} cruza com perigo!", "{atk} chega na linha de fundo!"
+            "{atk} testa o goleiro do {def}!", "{atk} cruza com perigo!", ""
         ],
         goal: [

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:341:13
             "{atk} testa o goleiro do {def}!", "{atk} cruza com perigo!", "{atk} chega na linha de fundo!"
         ],
         goal: [
-            "{atk} marca um belo gol!", "{atk} balança as redes!", "{atk} abre o placar com categoria!",
+            "", "{atk} balança as redes!", "{atk} abre o placar com categoria!",
             "{atk} GOL! Bola no fundo da rede!", "{atk} converte a chance!", "{atk} faz o que tinha que fazer!",
             "{atk} bate forte e marca!", "{atk} de placa!", "{atk} explode pra rede!",

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:341:41
             "{atk} testa o goleiro do {def}!", "{atk} cruza com perigo!", "{atk} chega na linha de fundo!"
         ],
         goal: [
-            "{atk} marca um belo gol!", "{atk} balança as redes!", "{atk} abre o placar com categoria!",
+            "{atk} marca um belo gol!", "", "{atk} abre o placar com categoria!",
             "{atk} GOL! Bola no fundo da rede!", "{atk} converte a chance!", "{atk} faz o que tinha que fazer!",
             "{atk} bate forte e marca!", "{atk} de placa!", "{atk} explode pra rede!",

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:342:13
         ],
         goal: [
             "{atk} marca um belo gol!", "{atk} balança as redes!", "{atk} abre o placar com categoria!",
-            "{atk} GOL! Bola no fundo da rede!", "{atk} converte a chance!", "{atk} faz o que tinha que fazer!",
+            "", "{atk} converte a chance!", "{atk} faz o que tinha que fazer!",
             "{atk} bate forte e marca!", "{atk} de placa!", "{atk} explode pra rede!",
             "{atk} marca em jogada ensaiada!", "GOOOL DO {atk}!", "{atk} acerta o canto!"

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:347:85
             "{atk} marca em jogada ensaiada!", "GOOOL DO {atk}!", "{atk} acerta o canto!"
         ],
         miss: [
-            "{atk} arrisca mas passa por cima!", "{atk} chuta e o goleiro segura!", "{atk} desperdiça!",
+            "{atk} arrisca mas passa por cima!", "{atk} chuta e o goleiro segura!", "",
             "{atk} pra fora! Quase!", "{atk} no travessão!", "{atk} chuta na rede pelo lado de fora!",
             "{atk} tenta de cabeça mas erra o alvo!", "{atk} chuta torto!", "{atk} pega mal na bola!",

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:347:50
             "{atk} marca em jogada ensaiada!", "GOOOL DO {atk}!", "{atk} acerta o canto!"
         ],
         miss: [
-            "{atk} arrisca mas passa por cima!", "{atk} chuta e o goleiro segura!", "{atk} desperdiça!",
+            "{atk} arrisca mas passa por cima!", "", "{atk} desperdiça!",
             "{atk} pra fora! Quase!", "{atk} no travessão!", "{atk} chuta na rede pelo lado de fora!",
             "{atk} tenta de cabeça mas erra o alvo!", "{atk} chuta torto!", "{atk} pega mal na bola!",

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:348:13
         ],
         miss: [
             "{atk} arrisca mas passa por cima!", "{atk} chuta e o goleiro segura!", "{atk} desperdiça!",
-            "{atk} pra fora! Quase!", "{atk} no travessão!", "{atk} chuta na rede pelo lado de fora!",
+            "", "{atk} no travessão!", "{atk} chuta na rede pelo lado de fora!",
             "{atk} tenta de cabeça mas erra o alvo!", "{atk} chuta torto!", "{atk} pega mal na bola!",
             "{atk} bate na trave!", "{atk} isolado!"

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:349:13
         miss: [
             "{atk} arrisca mas passa por cima!", "{atk} chuta e o goleiro segura!", "{atk} desperdiça!",
             "{atk} pra fora! Quase!", "{atk} no travessão!", "{atk} chuta na rede pelo lado de fora!",
-            "{atk} tenta de cabeça mas erra o alvo!", "{atk} chuta torto!", "{atk} pega mal na bola!",
+            "", "{atk} chuta torto!", "{atk} pega mal na bola!",
             "{atk} bate na trave!", "{atk} isolado!"
         ],

[Survived] ArrayDeclaration
src/engine/PlayerDevelopment.js:352:15
             "{atk} tenta de cabeça mas erra o alvo!", "{atk} chuta torto!", "{atk} pega mal na bola!",
             "{atk} bate na trave!", "{atk} isolado!"
         ],
-        save: [
-            "Defesaça do goleiro do {def}!", "O goleiro do {def} se estica e salva!", "Grande defesa!",
-            "Defesa milagrosa!", "Goleiro do {def} no lugar certo!", "Salva o {def}!",
-            "Que defesa!", "O goleiro do {def} agarra firme!", "Defesa em dois tempos!",
-            "Goleiro do {def} espalma!", "Defesona!"
-        ],
+        save: [],
         filler: [
             "{atk} roda a bola no meio.", "Jogo equilibrado no momento.", "{def} recua e espera.",

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:354:34
         ],
         save: [
             "Defesaça do goleiro do {def}!", "O goleiro do {def} se estica e salva!", "Grande defesa!",
-            "Defesa milagrosa!", "Goleiro do {def} no lugar certo!", "Salva o {def}!",
+            "Defesa milagrosa!", "", "Salva o {def}!",
             "Que defesa!", "O goleiro do {def} agarra firme!", "Defesa em dois tempos!",
             "Goleiro do {def} espalma!", "Defesona!"

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:354:70
         ],
         save: [
             "Defesaça do goleiro do {def}!", "O goleiro do {def} se estica e salva!", "Grande defesa!",
-            "Defesa milagrosa!", "Goleiro do {def} no lugar certo!", "Salva o {def}!",
+            "Defesa milagrosa!", "Goleiro do {def} no lugar certo!", "",
             "Que defesa!", "O goleiro do {def} agarra firme!", "Defesa em dois tempos!",
             "Goleiro do {def} espalma!", "Defesona!"
