[Survived] StringLiteral
src/engine/PlayerDevelopment.js:359:75
             "Goleiro do {def} espalma!", "Defesona!"
         ],
         filler: [
-            "{atk} roda a bola no meio.", "Jogo equilibrado no momento.", "{def} recua e espera.",
+            "{atk} roda a bola no meio.", "Jogo equilibrado no momento.", "",
             "Posse de bola dividida.", "Jogo cadenciado.", "{atk} controla o ritmo.",
             "Disputa de meio-campo.", "{def} marca com atenção.", "Bola no meio de campo.",

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:360:60
         ],
         filler: [
             "{atk} roda a bola no meio.", "Jogo equilibrado no momento.", "{def} recua e espera.",
-            "Posse de bola dividida.", "Jogo cadenciado.", "{atk} controla o ritmo.",
+            "Posse de bola dividida.", "Jogo cadenciado.", "",
             "Disputa de meio-campo.", "{def} marca com atenção.", "Bola no meio de campo.",
             "{atk} estuda a defesa do {def}.", "Pegada forte de ambos os lados.", "Jogo morno."

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:362:48
             "{atk} roda a bola no meio.", "Jogo equilibrado no momento.", "{def} recua e espera.",
             "Posse de bola dividida.", "Jogo cadenciado.", "{atk} controla o ritmo.",
             "Disputa de meio-campo.", "{def} marca com atenção.", "Bola no meio de campo.",
-            "{atk} estuda a defesa do {def}.", "Pegada forte de ambos os lados.", "Jogo morno."
+            "{atk} estuda a defesa do {def}.", "", "Jogo morno."
         ]
     },

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:367:13
     },
     offensive: {
         chance: [
-            "{atk} sobe em bloco! Pressão total!", "{atk} ataca com 4 jogadores!", "{atk} joga no abafa!",
+            "", "{atk} ataca com 4 jogadores!", "{atk} joga no abafa!",
             "{atk} avança em ataque maciço!", "{atk} massacra a defesa adversária!", "{atk} joga linha alta!",
             "{atk} ataca com tudo!", "{atk} parte pra cima!", "{atk} cerca a área do {def}!",

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:368:13
     offensive: {
         chance: [
             "{atk} sobe em bloco! Pressão total!", "{atk} ataca com 4 jogadores!", "{atk} joga no abafa!",
-            "{atk} avança em ataque maciço!", "{atk} massacra a defesa adversária!", "{atk} joga linha alta!",
+            "", "{atk} massacra a defesa adversária!", "{atk} joga linha alta!",
             "{atk} ataca com tudo!", "{atk} parte pra cima!", "{atk} cerca a área do {def}!",
             "{atk} bombardeia o gol!", "{atk} ataca com volume!", "{atk} mantém pressão alta!"

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:369:13
         chance: [
             "{atk} sobe em bloco! Pressão total!", "{atk} ataca com 4 jogadores!", "{atk} joga no abafa!",
             "{atk} avança em ataque maciço!", "{atk} massacra a defesa adversária!", "{atk} joga linha alta!",
-            "{atk} ataca com tudo!", "{atk} parte pra cima!", "{atk} cerca a área do {def}!",
+            "", "{atk} parte pra cima!", "{atk} cerca a área do {def}!",
             "{atk} bombardeia o gol!", "{atk} ataca com volume!", "{atk} mantém pressão alta!"
         ],

[Survived] ArrayDeclaration
src/engine/PlayerDevelopment.js:372:15
             "{atk} ataca com tudo!", "{atk} parte pra cima!", "{atk} cerca a área do {def}!",
             "{atk} bombardeia o gol!", "{atk} ataca com volume!", "{atk} mantém pressão alta!"
         ],
-        goal: [
-            "{atk} marca de goleada! O jogo é ataque!", "{atk} GOOOL! O jogo ofensivo funciona!", "{atk} explode na frente!",
-            "{atk} marca de bandeja!", "{atk} GOL após pressão constante!", "{atk} converte com facilidade!",
-            "{atk} GOOOL! Ataque imparável!", "{atk} arrasa! Que gol!", "{atk} faz parecer fácil!",
-            "{atk} cravar o gol!", "{atk} ataque-relâmpago!", "{atk} GOOOL espetacular!"
-        ],
+        goal: [],
         miss: [
             "{atk} se lança ao ataque mas perde a bola!", "{atk} arrisca de longe! Passou!",

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:374:77
         ],
         goal: [
             "{atk} marca de goleada! O jogo é ataque!", "{atk} GOOOL! O jogo ofensivo funciona!", "{atk} explode na frente!",
-            "{atk} marca de bandeja!", "{atk} GOL após pressão constante!", "{atk} converte com facilidade!",
+            "{atk} marca de bandeja!", "{atk} GOL após pressão constante!", "",
             "{atk} GOOOL! Ataque imparável!", "{atk} arrasa! Que gol!", "{atk} faz parecer fácil!",
             "{atk} cravar o gol!", "{atk} ataque-relâmpago!", "{atk} GOOOL espetacular!"

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:374:40
         ],
         goal: [
             "{atk} marca de goleada! O jogo é ataque!", "{atk} GOOOL! O jogo ofensivo funciona!", "{atk} explode na frente!",
-            "{atk} marca de bandeja!", "{atk} GOL após pressão constante!", "{atk} converte com facilidade!",
+            "{atk} marca de bandeja!", "", "{atk} converte com facilidade!",
             "{atk} GOOOL! Ataque imparável!", "{atk} arrasa! Que gol!", "{atk} faz parecer fácil!",
             "{atk} cravar o gol!", "{atk} ataque-relâmpago!", "{atk} GOOOL espetacular!"

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:375:13
         goal: [
             "{atk} marca de goleada! O jogo é ataque!", "{atk} GOOOL! O jogo ofensivo funciona!", "{atk} explode na frente!",
             "{atk} marca de bandeja!", "{atk} GOL após pressão constante!", "{atk} converte com facilidade!",
-            "{atk} GOOOL! Ataque imparável!", "{atk} arrasa! Que gol!", "{atk} faz parecer fácil!",
+            "", "{atk} arrasa! Que gol!", "{atk} faz parecer fácil!",
             "{atk} cravar o gol!", "{atk} ataque-relâmpago!", "{atk} GOOOL espetacular!"
         ],

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:376:36
             "{atk} marca de goleada! O jogo é ataque!", "{atk} GOOOL! O jogo ofensivo funciona!", "{atk} explode na frente!",
             "{atk} marca de bandeja!", "{atk} GOL após pressão constante!", "{atk} converte com facilidade!",
             "{atk} GOOOL! Ataque imparável!", "{atk} arrasa! Que gol!", "{atk} faz parecer fácil!",
-            "{atk} cravar o gol!", "{atk} ataque-relâmpago!", "{atk} GOOOL espetacular!"
+            "{atk} cravar o gol!", "", "{atk} GOOOL espetacular!"
         ],
         miss: [

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:376:63
             "{atk} marca de goleada! O jogo é ataque!", "{atk} GOOOL! O jogo ofensivo funciona!", "{atk} explode na frente!",
             "{atk} marca de bandeja!", "{atk} GOL após pressão constante!", "{atk} converte com facilidade!",
             "{atk} GOOOL! Ataque imparável!", "{atk} arrasa! Que gol!", "{atk} faz parecer fácil!",
-            "{atk} cravar o gol!", "{atk} ataque-relâmpago!", "{atk} GOOOL espetacular!"
+            "{atk} cravar o gol!", "{atk} ataque-relâmpago!", ""
         ],
         miss: [

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:379:13
             "{atk} cravar o gol!", "{atk} ataque-relâmpago!", "{atk} GOOOL espetacular!"
         ],
         miss: [
-            "{atk} se lança ao ataque mas perde a bola!", "{atk} arrisca de longe! Passou!",
+            "", "{atk} arrisca de longe! Passou!",
             "{atk} cabeceia e tira tinta!", "{atk} chuta forte mas erra o alvo!", "{atk} desperdiça gol feito!",
             "{atk} pega mal e a bola sobe!", "{atk} arrisca chute torto!", "{atk} perde gol incrível!"

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:380:13
         ],
         miss: [
             "{atk} se lança ao ataque mas perde a bola!", "{atk} arrisca de longe! Passou!",
-            "{atk} cabeceia e tira tinta!", "{atk} chuta forte mas erra o alvo!", "{atk} desperdiça gol feito!",
+            "", "{atk} chuta forte mas erra o alvo!", "{atk} desperdiça gol feito!",
             "{atk} pega mal e a bola sobe!", "{atk} arrisca chute torto!", "{atk} perde gol incrível!"
         ],

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:381:76
         miss: [
             "{atk} se lança ao ataque mas perde a bola!", "{atk} arrisca de longe! Passou!",
             "{atk} cabeceia e tira tinta!", "{atk} chuta forte mas erra o alvo!", "{atk} desperdiça gol feito!",
-            "{atk} pega mal e a bola sobe!", "{atk} arrisca chute torto!", "{atk} perde gol incrível!"
+            "{atk} pega mal e a bola sobe!", "{atk} arrisca chute torto!", ""
         ],
         save: [

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:381:46
         miss: [
             "{atk} se lança ao ataque mas perde a bola!", "{atk} arrisca de longe! Passou!",
             "{atk} cabeceia e tira tinta!", "{atk} chuta forte mas erra o alvo!", "{atk} desperdiça gol feito!",
-            "{atk} pega mal e a bola sobe!", "{atk} arrisca chute torto!", "{atk} perde gol incrível!"
+            "{atk} pega mal e a bola sobe!", "", "{atk} perde gol incrível!"
         ],
         save: [

[Survived] ArrayDeclaration
src/engine/PlayerDevelopment.js:383:15
             "{atk} cabeceia e tira tinta!", "{atk} chuta forte mas erra o alvo!", "{atk} desperdiça gol feito!",
             "{atk} pega mal e a bola sobe!", "{atk} arrisca chute torto!", "{atk} perde gol incrível!"
         ],
-        save: [
-            "Milagre do goleiro do {def}! Quase gol!", "O goleiro do {def} salva o time!",
-            "Defesaça espetacular do {def}!", "{def} se segura no goleiro!", "O goleiro do {def} evita o pior!",
-            "Defesa heróica do {def}!", "{def} está vivo graças ao goleiro!"
-        ],
+        save: [],
         filler: [
             "{atk} mantém pressão ofensiva. {def} sofre.", "Jogo aberto, {atk} domina o campo de ataque.",

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:384:56
             "{atk} pega mal e a bola sobe!", "{atk} arrisca chute torto!", "{atk} perde gol incrível!"
         ],
         save: [
-            "Milagre do goleiro do {def}! Quase gol!", "O goleiro do {def} salva o time!",
+            "Milagre do goleiro do {def}! Quase gol!", "",
             "Defesaça espetacular do {def}!", "{def} se segura no goleiro!", "O goleiro do {def} evita o pior!",
             "Defesa heróica do {def}!", "{def} está vivo graças ao goleiro!"

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:384:13
             "{atk} pega mal e a bola sobe!", "{atk} arrisca chute torto!", "{atk} perde gol incrível!"
         ],
         save: [
-            "Milagre do goleiro do {def}! Quase gol!", "O goleiro do {def} salva o time!",
+            "", "O goleiro do {def} salva o time!",
             "Defesaça espetacular do {def}!", "{def} se segura no goleiro!", "O goleiro do {def} evita o pior!",
             "Defesa heróica do {def}!", "{def} está vivo graças ao goleiro!"

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:385:78
         ],
         save: [
             "Milagre do goleiro do {def}! Quase gol!", "O goleiro do {def} salva o time!",
-            "Defesaça espetacular do {def}!", "{def} se segura no goleiro!", "O goleiro do {def} evita o pior!",
+            "Defesaça espetacular do {def}!", "{def} se segura no goleiro!", "",
             "Defesa heróica do {def}!", "{def} está vivo graças ao goleiro!"
         ],

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:386:13
         save: [
             "Milagre do goleiro do {def}! Quase gol!", "O goleiro do {def} salva o time!",
             "Defesaça espetacular do {def}!", "{def} se segura no goleiro!", "O goleiro do {def} evita o pior!",
-            "Defesa heróica do {def}!", "{def} está vivo graças ao goleiro!"
+            "", "{def} está vivo graças ao goleiro!"
         ],
         filler: [

[Survived] ArrayDeclaration
src/engine/PlayerDevelopment.js:388:17
             "Defesaça espetacular do {def}!", "{def} se segura no goleiro!", "O goleiro do {def} evita o pior!",
             "Defesa heróica do {def}!", "{def} está vivo graças ao goleiro!"
         ],
-        filler: [
-            "{atk} mantém pressão ofensiva. {def} sofre.", "Jogo aberto, {atk} domina o campo de ataque.",
-            "{atk} ataca incessantemente.", "{def} se defende como pode.", "{atk} põe muita gente no ataque.",
-            "Festival ofensivo do {atk}!", "{def} encurralado.", "{atk} não dá trégua.",
-            "Pressão sufocante do {atk}.", "{def} respira mal."
-        ]
+        filler: []
     },
     defensive: {

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:390:13
         ],
         filler: [
             "{atk} mantém pressão ofensiva. {def} sofre.", "Jogo aberto, {atk} domina o campo de ataque.",
-            "{atk} ataca incessantemente.", "{def} se defende como pode.", "{atk} põe muita gente no ataque.",
+            "", "{def} se defende como pode.", "{atk} põe muita gente no ataque.",
             "Festival ofensivo do {atk}!", "{def} encurralado.", "{atk} não dá trégua.",
             "Pressão sufocante do {atk}.", "{def} respira mal."

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:390:76
         ],
         filler: [
             "{atk} mantém pressão ofensiva. {def} sofre.", "Jogo aberto, {atk} domina o campo de ataque.",
-            "{atk} ataca incessantemente.", "{def} se defende como pode.", "{atk} põe muita gente no ataque.",
+            "{atk} ataca incessantemente.", "{def} se defende como pode.", "",
             "Festival ofensivo do {atk}!", "{def} encurralado.", "{atk} não dá trégua.",
             "Pressão sufocante do {atk}.", "{def} respira mal."

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:391:66
         filler: [
             "{atk} mantém pressão ofensiva. {def} sofre.", "Jogo aberto, {atk} domina o campo de ataque.",
             "{atk} ataca incessantemente.", "{def} se defende como pode.", "{atk} põe muita gente no ataque.",
-            "Festival ofensivo do {atk}!", "{def} encurralado.", "{atk} não dá trégua.",
+            "Festival ofensivo do {atk}!", "{def} encurralado.", "",
             "Pressão sufocante do {atk}.", "{def} respira mal."
         ]

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:391:44
         filler: [
             "{atk} mantém pressão ofensiva. {def} sofre.", "Jogo aberto, {atk} domina o campo de ataque.",
             "{atk} ataca incessantemente.", "{def} se defende como pode.", "{atk} põe muita gente no ataque.",
-            "Festival ofensivo do {atk}!", "{def} encurralado.", "{atk} não dá trégua.",
+            "Festival ofensivo do {atk}!", "", "{atk} não dá trégua.",
             "Pressão sufocante do {atk}.", "{def} respira mal."
         ]

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:392:13
             "{atk} mantém pressão ofensiva. {def} sofre.", "Jogo aberto, {atk} domina o campo de ataque.",
             "{atk} ataca incessantemente.", "{def} se defende como pode.", "{atk} põe muita gente no ataque.",
             "Festival ofensivo do {atk}!", "{def} encurralado.", "{atk} não dá trégua.",
-            "Pressão sufocante do {atk}.", "{def} respira mal."
+            "", "{def} respira mal."
         ]
     },

[Survived] ArrayDeclaration
src/engine/PlayerDevelopment.js:396:17
         ]
     },
     defensive: {
-        chance: [
-            "{atk} sai em contra-ataque rápido!", "{atk} rouba a bola e sai correndo!", "{atk} lança na velocidade!",
-            "{atk} explora espaço deixado!", "{atk} corre no contragolpe!", "{atk} aproveita brecha!",
-            "{atk} surpreende com velocidade!", "{atk} dispara em transição!", "{atk} pega o {def} desligado!"
-        ],
+        chance: [],
         goal: [
             "{atk} marca no contra-ataque! Mortal!", "{atk} GOOOL de contra! Eficiência pura!", "{atk} letal na saída!",

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:398:46
     defensive: {
         chance: [
             "{atk} sai em contra-ataque rápido!", "{atk} rouba a bola e sai correndo!", "{atk} lança na velocidade!",
-            "{atk} explora espaço deixado!", "{atk} corre no contragolpe!", "{atk} aproveita brecha!",
+            "{atk} explora espaço deixado!", "", "{atk} aproveita brecha!",
             "{atk} surpreende com velocidade!", "{atk} dispara em transição!", "{atk} pega o {def} desligado!"
         ],

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:402:13
             "{atk} surpreende com velocidade!", "{atk} dispara em transição!", "{atk} pega o {def} desligado!"
         ],
         goal: [
-            "{atk} marca no contra-ataque! Mortal!", "{atk} GOOOL de contra! Eficiência pura!", "{atk} letal na saída!",
+            "", "{atk} GOOOL de contra! Eficiência pura!", "{atk} letal na saída!",
             "{atk} GOL fulminante na transição!", "{atk} converte contragolpe!", "{atk} mata na velocidade!",
             "{atk} GOOOL! Contra-ataque cirúrgico!", "{atk} marca em jogada relâmpago!"

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:402:97
             "{atk} surpreende com velocidade!", "{atk} dispara em transição!", "{atk} pega o {def} desligado!"
         ],
         goal: [
-            "{atk} marca no contra-ataque! Mortal!", "{atk} GOOOL de contra! Eficiência pura!", "{atk} letal na saída!",
+            "{atk} marca no contra-ataque! Mortal!", "{atk} GOOOL de contra! Eficiência pura!", "",
             "{atk} GOL fulminante na transição!", "{atk} converte contragolpe!", "{atk} mata na velocidade!",
             "{atk} GOOOL! Contra-ataque cirúrgico!", "{atk} marca em jogada relâmpago!"

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:408:13
         ],
         miss: [
             "{atk} tenta o contra mas perde o timing!", "{atk} chega mas finaliza mal!",
-            "{atk} sai rápido mas erra a conclusão!", "{atk} dispara mas chuta isolado!"
+            "", "{atk} dispara mas chuta isolado!"
         ],
         save: [

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:411:13
             "{atk} sai rápido mas erra a conclusão!", "{atk} dispara mas chuta isolado!"
         ],
         save: [
-            "O goleiro do {def} fecha o ângulo!", "Salvou! {def} sobrevive!",
+            "", "Salvou! {def} sobrevive!",
             "Defesaça do {def}!", "{def} agarra no contra!"
         ],

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:416:13
         ],
         filler: [
             "{atk} recua e fecha os espaços.", "Jogo truncado. {atk} espera o momento certo.",
-            "{def} tenta furar a retranca.", "{atk} compacto na defesa.", "Marcação cerrada.",
+            "", "{atk} compacto na defesa.", "Marcação cerrada.",
             "{def} bate na muralha do {atk}.", "{atk} sufoca o jogo.", "Cadência baixa.",
             "{def} sem espaço pra criar."

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:416:75
         ],
         filler: [
             "{atk} recua e fecha os espaços.", "Jogo truncado. {atk} espera o momento certo.",
-            "{def} tenta furar a retranca.", "{atk} compacto na defesa.", "Marcação cerrada.",
+            "{def} tenta furar a retranca.", "{atk} compacto na defesa.", "",
             "{def} bate na muralha do {atk}.", "{atk} sufoca o jogo.", "Cadência baixa.",
             "{def} sem espaço pra criar."

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:423:86
     },
     pressing: {
         chance: [
-            "{atk} rouba na saída de bola do {def}!", "{atk} pressiona e recupera!", "{atk} não deixa {def} respirar!",
+            "{atk} rouba na saída de bola do {def}!", "{atk} pressiona e recupera!", "",
             "{atk} ataca em cima da marcação!", "{atk} encurta espaços!", "{atk} sufoca o adversário!",
             "{atk} rouba alta e parte!", "{atk} marca por pressão!"

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:423:55
     },
     pressing: {
         chance: [
-            "{atk} rouba na saída de bola do {def}!", "{atk} pressiona e recupera!", "{atk} não deixa {def} respirar!",
+            "{atk} rouba na saída de bola do {def}!", "", "{atk} não deixa {def} respirar!",
             "{atk} ataca em cima da marcação!", "{atk} encurta espaços!", "{atk} sufoca o adversário!",
             "{atk} rouba alta e parte!", "{atk} marca por pressão!"

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:424:13
     pressing: {
         chance: [
             "{atk} rouba na saída de bola do {def}!", "{atk} pressiona e recupera!", "{atk} não deixa {def} respirar!",
-            "{atk} ataca em cima da marcação!", "{atk} encurta espaços!", "{atk} sufoca o adversário!",
+            "", "{atk} encurta espaços!", "{atk} sufoca o adversário!",
             "{atk} rouba alta e parte!", "{atk} marca por pressão!"
         ],

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:429:40
         ],
         goal: [
             "{atk} marca após pressão alta! Asfixiou!", "{atk} GOOOL! Pressionou e converteu!", "{atk} rouba e marca!",
-            "{atk} GOL após roubada!", "{atk} pressiona e mata!", "{atk} converte erro do {def}!"
+            "{atk} GOL após roubada!", "", "{atk} converte erro do {def}!"
         ],
         miss: [

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:433:13
         ],
         miss: [
             "{atk} pressiona mas se desgasta!", "{atk} erra na pressão e abre espaço!",
-            "{atk} cansa e perde objetivo!"
+            ""
         ],
         save: [

[Survived] ArrayDeclaration
src/engine/PlayerDevelopment.js:439:17
             "O goleiro do {def} segura firme!", "Pressão do {atk} não consegue furar!",
             "Defesaça! Ataque parou na trave!"
         ],
-        filler: [
-            "{atk} mantém marcação altíssima. {def} sem ar.", "Intensidade do {atk} é impressionante.",
-            "{def} não consegue sair jogando.", "{atk} sufoca!", "Pressão alta funcionando!",
-            "{def} sem espaço.", "{atk} não dá tempo de pensar.", "Jogo intenso!"
-        ]
+        filler: []
     },
     counter: {

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:441:49
         ],
         filler: [
             "{atk} mantém marcação altíssima. {def} sem ar.", "Intensidade do {atk} é impressionante.",
-            "{def} não consegue sair jogando.", "{atk} sufoca!", "Pressão alta funcionando!",
+            "{def} não consegue sair jogando.", "", "Pressão alta funcionando!",
             "{def} sem espaço.", "{atk} não dá tempo de pensar.", "Jogo intenso!"
         ]

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:442:13
         filler: [
             "{atk} mantém marcação altíssima. {def} sem ar.", "Intensidade do {atk} é impressionante.",
             "{def} não consegue sair jogando.", "{atk} sufoca!", "Pressão alta funcionando!",
-            "{def} sem espaço.", "{atk} não dá tempo de pensar.", "Jogo intenso!"
+            "", "{atk} não dá tempo de pensar.", "Jogo intenso!"
         ]
     },

[Survived] ArrayDeclaration
src/engine/PlayerDevelopment.js:446:17
         ]
     },
     counter: {
-        chance: [
-            "{atk} absorve e sai em velocidade!", "{atk} arma o contra-ataque mortal!", "{atk} espera, rouba e lança!",
-            "{atk} segura e dispara!", "{atk} aguarda momento e parte!", "{atk} explora vazio!"
-        ],
+        chance: [],
         goal: [
             "{atk} fulmina no contra-ataque! GOOOL!", "{atk} mata o jogo na transição!", "{atk} eficiente como sempre!",

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:447:51
     },
     counter: {
         chance: [
-            "{atk} absorve e sai em velocidade!", "{atk} arma o contra-ataque mortal!", "{atk} espera, rouba e lança!",
+            "{atk} absorve e sai em velocidade!", "", "{atk} espera, rouba e lança!",
             "{atk} segura e dispara!", "{atk} aguarda momento e parte!", "{atk} explora vazio!"
         ],

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:448:13
     counter: {
         chance: [
             "{atk} absorve e sai em velocidade!", "{atk} arma o contra-ataque mortal!", "{atk} espera, rouba e lança!",
-            "{atk} segura e dispara!", "{atk} aguarda momento e parte!", "{atk} explora vazio!"
+            "", "{atk} aguarda momento e parte!", "{atk} explora vazio!"
         ],
         goal: [

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:452:13
         ],
         goal: [
             "{atk} fulmina no contra-ataque! GOOOL!", "{atk} mata o jogo na transição!", "{atk} eficiente como sempre!",
-            "{atk} GOOOL letal de contra!", "{atk} converte na primeira chance!"
+            "", "{atk} converte na primeira chance!"
         ],
         miss: [

[Survived] ArrayDeclaration
src/engine/PlayerDevelopment.js:454:15
             "{atk} fulmina no contra-ataque! GOOOL!", "{atk} mata o jogo na transição!", "{atk} eficiente como sempre!",
             "{atk} GOOOL letal de contra!", "{atk} converte na primeira chance!"
         ],
-        miss: [
-            "{atk} tenta o contra mas isolou!", "{atk} sai rápido mas errou o passe final!",
-            "{atk} dispara mas perde a bola!"
-        ],
+        miss: [],
         save: [
             "Defesaça! O goleiro do {def} estava preparado!", "O contra do {atk} é barrado!",

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:459:13
             "{atk} dispara mas perde a bola!"
         ],
         save: [
-            "Defesaça! O goleiro do {def} estava preparado!", "O contra do {atk} é barrado!",
+            "", "O contra do {atk} é barrado!",
             "{def} agarra no contragolpe!"
         ],

[Survived] ArrayDeclaration
src/engine/PlayerDevelopment.js:462:17
             "Defesaça! O goleiro do {def} estava preparado!", "O contra do {atk} é barrado!",
             "{def} agarra no contragolpe!"
         ],
-        filler: [
-            "{atk} espera pacientemente.", "{def} tem a bola mas não acha espaço.", "Jogo de xadrez tático.",
-            "{atk} retraído estuda momento.", "{def} ataca mas {atk} segura.", "Disputa estratégica.",
-            "{atk} aguarda o erro do {def}."
-        ]
+        filler: []
     },
     possession: {

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:464:47
         ],
         filler: [
             "{atk} espera pacientemente.", "{def} tem a bola mas não acha espaço.", "Jogo de xadrez tático.",
-            "{atk} retraído estuda momento.", "{def} ataca mas {atk} segura.", "Disputa estratégica.",
+            "{atk} retraído estuda momento.", "", "Disputa estratégica.",
             "{atk} aguarda o erro do {def}."
         ]

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:464:13
         ],
         filler: [
             "{atk} espera pacientemente.", "{def} tem a bola mas não acha espaço.", "Jogo de xadrez tático.",
-            "{atk} retraído estuda momento.", "{def} ataca mas {atk} segura.", "Disputa estratégica.",
+            "", "{def} ataca mas {atk} segura.", "Disputa estratégica.",
             "{atk} aguarda o erro do {def}."
         ]

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:471:86
     possession: {
         chance: [
             "{atk} troca passes e acha o espaço!", "{atk} desfaz a marcação com posse!", "{atk} cansa o {def} com toques!",
-            "{atk} circula a bola e penetra!", "{atk} chega após paciente armação!", "{atk} cria com posse!"
+            "{atk} circula a bola e penetra!", "{atk} chega após paciente armação!", ""
         ],
         goal: [

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:474:92
             "{atk} circula a bola e penetra!", "{atk} chega após paciente armação!", "{atk} cria com posse!"
         ],
         goal: [
-            "{atk} marca após 25 toques! Posse letal!", "{atk} GOOOL! A paciência pagou!", "{atk} perfura com maestria!",
+            "{atk} marca após 25 toques! Posse letal!", "{atk} GOOOL! A paciência pagou!", "",
             "{atk} GOL após posse longa!", "{atk} converte armação minuciosa!"
         ],

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:482:50
             "{atk} demora demais e perde a chance!"
         ],
         save: [
-            "O goleiro do {def} faz a leitura!", "Boa defesa! {def} resiste à posse!",
+            "O goleiro do {def} faz a leitura!", "",
             "Defesaça! {def} aguenta!"
         ],

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:486:13
             "Defesaça! {def} aguenta!"
         ],
         filler: [
-            "{atk} domina 65% da posse.", "Toque, toque, toque... {def} corre atrás.", "{atk} não se apressa.",
+            "", "Toque, toque, toque... {def} corre atrás.", "{atk} não se apressa.",
             "{atk} mantém o ritmo.", "{def} cansa de correr.", "{atk} dita o tempo.",
             "Posse imensa do {atk}.", "{def} sem a bola."

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:486:43
             "Defesaça! {def} aguenta!"
         ],
         filler: [
-            "{atk} domina 65% da posse.", "Toque, toque, toque... {def} corre atrás.", "{atk} não se apressa.",
+            "{atk} domina 65% da posse.", "", "{atk} não se apressa.",
             "{atk} mantém o ritmo.", "{def} cansa de correr.", "{atk} dita o tempo.",
             "Posse imensa do {atk}.", "{def} sem a bola."

[Survived] StringLiteral
src/engine/PlayerDevelopment.js:488:39
         filler: [
             "{atk} domina 65% da posse.", "Toque, toque, toque... {def} corre atrás.", "{atk} não se apressa.",
             "{atk} mantém o ritmo.", "{def} cansa de correr.", "{atk} dita o tempo.",
-            "Posse imensa do {atk}.", "{def} sem a bola."
+            "Posse imensa do {atk}.", ""
         ]
     }
