[Survived] StringLiteral
src/engine/PlayerDevelopment.js:488:13
         filler: [
             "{atk} domina 65% da posse.", "Toque, toque, toque... {def} corre atrás.", "{atk} não se apressa.",
             "{atk} mantém o ritmo.", "{def} cansa de correr.", "{atk} dita o tempo.",
-            "Posse imensa do {atk}.", "{def} sem a bola."
+            "", "{def} sem a bola."
         ]
     }

[Survived] BlockStatement
src/engine/PlayerDevelopment.js:493:28
     }
 };
 
-function recalcOvr(player) {
-    const a = player.attributes;
-    switch (player.position) {
-        case "GOL": player.ovr = Math.floor(a.REF * 0.5 + a.DEF * 0.2 + a.FIS * 0.3); break;
-        case "DEF": player.ovr = Math.floor(a.DEF * 0.6 + a.FIS * 0.25 + a.CRI * 0.15); break;
-        case "MEI": player.ovr = Math.floor(a.CRI * 0.5 + a.FIS * 0.2 + a.FIN * 0.15 + a.DEF * 0.15); break;
-        case "ATA": player.ovr = Math.floor(a.FIN * 0.5 + a.FIS * 0.25 + a.CRI * 0.25); break;
-        default: player.ovr = Math.floor((a.FIS + a.DEF + a.CRI + a.FIN + (a.REF || 50)) / 5);
-    }
-
-    // Hedonic Pricing recalculation upon OVR change
-    player.marketValue = calcMarketValue({
-        playerOvr: player.ovr,
-        playerAge: player.age || 25,
-        playerPotential: player.potential,
-        playerContract: player.contract?.weeksLeft ?? 26,
-        playerForm: player.form?.trend || 0
-    });
-}
+function recalcOvr(player) {}
 

[Survived] ArithmeticOperator
src/engine/PlayerDevelopment.js:496:45
 function recalcOvr(player) {
     const a = player.attributes;
     switch (player.position) {
-        case "GOL": player.ovr = Math.floor(a.REF * 0.5 + a.DEF * 0.2 + a.FIS * 0.3); break;
+        case "GOL": player.ovr = Math.floor(a.REF * 0.5 - a.DEF * 0.2 + a.FIS * 0.3); break;
         case "DEF": player.ovr = Math.floor(a.DEF * 0.6 + a.FIS * 0.25 + a.CRI * 0.15); break;
         case "MEI": player.ovr = Math.floor(a.CRI * 0.5 + a.FIS * 0.2 + a.FIN * 0.15 + a.DEF * 0.15); break;

[Survived] ArithmeticOperator
src/engine/PlayerDevelopment.js:496:45
 function recalcOvr(player) {
     const a = player.attributes;
     switch (player.position) {
-        case "GOL": player.ovr = Math.floor(a.REF * 0.5 + a.DEF * 0.2 + a.FIS * 0.3); break;
+        case "GOL": player.ovr = Math.floor(a.REF * 0.5 + a.DEF * 0.2 - a.FIS * 0.3); break;
         case "DEF": player.ovr = Math.floor(a.DEF * 0.6 + a.FIS * 0.25 + a.CRI * 0.15); break;
         case "MEI": player.ovr = Math.floor(a.CRI * 0.5 + a.FIS * 0.2 + a.FIN * 0.15 + a.DEF * 0.15); break;

[Survived] ArithmeticOperator
src/engine/PlayerDevelopment.js:497:45
     const a = player.attributes;
     switch (player.position) {
         case "GOL": player.ovr = Math.floor(a.REF * 0.5 + a.DEF * 0.2 + a.FIS * 0.3); break;
-        case "DEF": player.ovr = Math.floor(a.DEF * 0.6 + a.FIS * 0.25 + a.CRI * 0.15); break;
+        case "DEF": player.ovr = Math.floor(a.DEF * 0.6 - a.FIS * 0.25 + a.CRI * 0.15); break;
         case "MEI": player.ovr = Math.floor(a.CRI * 0.5 + a.FIS * 0.2 + a.FIN * 0.15 + a.DEF * 0.15); break;
         case "ATA": player.ovr = Math.floor(a.FIN * 0.5 + a.FIS * 0.25 + a.CRI * 0.25); break;

[Survived] ArithmeticOperator
src/engine/PlayerDevelopment.js:497:45
     const a = player.attributes;
     switch (player.position) {
         case "GOL": player.ovr = Math.floor(a.REF * 0.5 + a.DEF * 0.2 + a.FIS * 0.3); break;
-        case "DEF": player.ovr = Math.floor(a.DEF * 0.6 + a.FIS * 0.25 + a.CRI * 0.15); break;
+        case "DEF": player.ovr = Math.floor(a.DEF * 0.6 + a.FIS * 0.25 - a.CRI * 0.15); break;
         case "MEI": player.ovr = Math.floor(a.CRI * 0.5 + a.FIS * 0.2 + a.FIN * 0.15 + a.DEF * 0.15); break;
         case "ATA": player.ovr = Math.floor(a.FIN * 0.5 + a.FIS * 0.25 + a.CRI * 0.25); break;

[Survived] ArithmeticOperator
src/engine/PlayerDevelopment.js:498:45
     switch (player.position) {
         case "GOL": player.ovr = Math.floor(a.REF * 0.5 + a.DEF * 0.2 + a.FIS * 0.3); break;
         case "DEF": player.ovr = Math.floor(a.DEF * 0.6 + a.FIS * 0.25 + a.CRI * 0.15); break;
-        case "MEI": player.ovr = Math.floor(a.CRI * 0.5 + a.FIS * 0.2 + a.FIN * 0.15 + a.DEF * 0.15); break;
+        case "MEI": player.ovr = Math.floor(a.CRI * 0.5 + a.FIS * 0.2 + a.FIN * 0.15 - a.DEF * 0.15); break;
         case "ATA": player.ovr = Math.floor(a.FIN * 0.5 + a.FIS * 0.25 + a.CRI * 0.25); break;
         default: player.ovr = Math.floor((a.FIS + a.DEF + a.CRI + a.FIN + (a.REF || 50)) / 5);

[Survived] ArithmeticOperator
src/engine/PlayerDevelopment.js:498:73
     switch (player.position) {
         case "GOL": player.ovr = Math.floor(a.REF * 0.5 + a.DEF * 0.2 + a.FIS * 0.3); break;
         case "DEF": player.ovr = Math.floor(a.DEF * 0.6 + a.FIS * 0.25 + a.CRI * 0.15); break;
-        case "MEI": player.ovr = Math.floor(a.CRI * 0.5 + a.FIS * 0.2 + a.FIN * 0.15 + a.DEF * 0.15); break;
+        case "MEI": player.ovr = Math.floor(a.CRI * 0.5 + a.FIS * 0.2 + a.FIN / 0.15 + a.DEF * 0.15); break;
         case "ATA": player.ovr = Math.floor(a.FIN * 0.5 + a.FIS * 0.25 + a.CRI * 0.25); break;
         default: player.ovr = Math.floor((a.FIS + a.DEF + a.CRI + a.FIN + (a.REF || 50)) / 5);

[Survived] ArithmeticOperator
src/engine/PlayerDevelopment.js:499:45
         case "GOL": player.ovr = Math.floor(a.REF * 0.5 + a.DEF * 0.2 + a.FIS * 0.3); break;
         case "DEF": player.ovr = Math.floor(a.DEF * 0.6 + a.FIS * 0.25 + a.CRI * 0.15); break;
         case "MEI": player.ovr = Math.floor(a.CRI * 0.5 + a.FIS * 0.2 + a.FIN * 0.15 + a.DEF * 0.15); break;
-        case "ATA": player.ovr = Math.floor(a.FIN * 0.5 + a.FIS * 0.25 + a.CRI * 0.25); break;
+        case "ATA": player.ovr = Math.floor(a.FIN * 0.5 - a.FIS * 0.25 + a.CRI * 0.25); break;
         default: player.ovr = Math.floor((a.FIS + a.DEF + a.CRI + a.FIN + (a.REF || 50)) / 5);
     }

[Survived] ArithmeticOperator
src/engine/PlayerDevelopment.js:499:45
         case "GOL": player.ovr = Math.floor(a.REF * 0.5 + a.DEF * 0.2 + a.FIS * 0.3); break;
         case "DEF": player.ovr = Math.floor(a.DEF * 0.6 + a.FIS * 0.25 + a.CRI * 0.15); break;
         case "MEI": player.ovr = Math.floor(a.CRI * 0.5 + a.FIS * 0.2 + a.FIN * 0.15 + a.DEF * 0.15); break;
-        case "ATA": player.ovr = Math.floor(a.FIN * 0.5 + a.FIS * 0.25 + a.CRI * 0.25); break;
+        case "ATA": player.ovr = Math.floor(a.FIN / 0.5 + a.FIS * 0.25 + a.CRI * 0.25); break;
         default: player.ovr = Math.floor((a.FIS + a.DEF + a.CRI + a.FIN + (a.REF || 50)) / 5);
     }

[NoCoverage] ArithmeticOperator
src/engine/PlayerDevelopment.js:500:42
         case "DEF": player.ovr = Math.floor(a.DEF * 0.6 + a.FIS * 0.25 + a.CRI * 0.15); break;
         case "MEI": player.ovr = Math.floor(a.CRI * 0.5 + a.FIS * 0.2 + a.FIN * 0.15 + a.DEF * 0.15); break;
         case "ATA": player.ovr = Math.floor(a.FIN * 0.5 + a.FIS * 0.25 + a.CRI * 0.25); break;
-        default: player.ovr = Math.floor((a.FIS + a.DEF + a.CRI + a.FIN + (a.REF || 50)) / 5);
+        default: player.ovr = Math.floor((a.FIS + a.DEF + a.CRI + a.FIN + (a.REF || 50)) * 5);
     }
 

[NoCoverage] ArithmeticOperator
src/engine/PlayerDevelopment.js:500:43
         case "DEF": player.ovr = Math.floor(a.DEF * 0.6 + a.FIS * 0.25 + a.CRI * 0.15); break;
         case "MEI": player.ovr = Math.floor(a.CRI * 0.5 + a.FIS * 0.2 + a.FIN * 0.15 + a.DEF * 0.15); break;
         case "ATA": player.ovr = Math.floor(a.FIN * 0.5 + a.FIS * 0.25 + a.CRI * 0.25); break;
-        default: player.ovr = Math.floor((a.FIS + a.DEF + a.CRI + a.FIN + (a.REF || 50)) / 5);
+        default: player.ovr = Math.floor((a.FIS + a.DEF + a.CRI + a.FIN - (a.REF || 50)) / 5);
     }
 

[Survived] ConditionalExpression
src/engine/PlayerDevelopment.js:506:20
     // Hedonic Pricing recalculation upon OVR change
     player.marketValue = calcMarketValue({
         playerOvr: player.ovr,
-        playerAge: player.age || 25,
+        playerAge: false,
         playerPotential: player.potential,
         playerContract: player.contract?.weeksLeft ?? 26,

[Survived] ConditionalExpression
src/engine/PlayerDevelopment.js:506:20
     // Hedonic Pricing recalculation upon OVR change
     player.marketValue = calcMarketValue({
         playerOvr: player.ovr,
-        playerAge: player.age || 25,
+        playerAge: true,
         playerPotential: player.potential,
         playerContract: player.contract?.weeksLeft ?? 26,

[Survived] LogicalOperator
src/engine/PlayerDevelopment.js:508:25
         playerOvr: player.ovr,
         playerAge: player.age || 25,
         playerPotential: player.potential,
-        playerContract: player.contract?.weeksLeft ?? 26,
+        playerContract: player.contract?.weeksLeft && 26,
         playerForm: player.form?.trend || 0
     });

[Survived] OptionalChaining
src/engine/PlayerDevelopment.js:508:25
         playerOvr: player.ovr,
         playerAge: player.age || 25,
         playerPotential: player.potential,
-        playerContract: player.contract?.weeksLeft ?? 26,
+        playerContract: player.contract.weeksLeft ?? 26,
         playerForm: player.form?.trend || 0
     });

[Survived] LogicalOperator
src/engine/PlayerDevelopment.js:509:21
         playerAge: player.age || 25,
         playerPotential: player.potential,
         playerContract: player.contract?.weeksLeft ?? 26,
-        playerForm: player.form?.trend || 0
+        playerForm: player.form?.trend && 0
     });
 }

[Survived] ConditionalExpression
src/engine/PlayerDevelopment.js:509:21
         playerAge: player.age || 25,
         playerPotential: player.potential,
         playerContract: player.contract?.weeksLeft ?? 26,
-        playerForm: player.form?.trend || 0
+        playerForm: false
     });
 }
